Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_EXTINT2R_EXTINT2_Pos              _UINT32_(0)                                          /* (PPS_EXTINT2R) EXTINT2 Position */
#define PPS_EXTINT2R_EXTINT2_Msk              (_UINT32_(0x1F) << PPS_EXTINT2R_EXTINT2_Pos)         /* (PPS_EXTINT2R) EXTINT2 Mask */
#define PPS_EXTINT2R_EXTINT2(value)           (PPS_EXTINT2R_EXTINT2_Msk & (_UINT32_(value) << PPS_EXTINT2R_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the PPS_EXTINT2R register */
#define   PPS_EXTINT2R_EXTINT2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT2R) OFF  */
#define   PPS_EXTINT2R_EXTINT2_RPA2_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT2R) RPA2  */
#define   PPS_EXTINT2R_EXTINT2_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_EXTINT2R) RPA8  */
#define   PPS_EXTINT2R_EXTINT2_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT2R) RPA13  */
#define   PPS_EXTINT2R_EXTINT2_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT2R) RPB2  */
#define   PPS_EXTINT2R_EXTINT2_RPB8_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT2R) RPB8  */
#define   PPS_EXTINT2R_EXTINT2_RPB13_Val      _UINT32_(0x6)                                        /* (PPS_EXTINT2R) RPB13  */
#define   PPS_EXTINT2R_EXTINT2_RPC8_Val       _UINT32_(0x7)                                        /* (PPS_EXTINT2R) RPC8  */
#define   PPS_EXTINT2R_EXTINT2_RPD2_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT2R) RPD2  */
#define   PPS_EXTINT2R_EXTINT2_RPE2_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT2R) RPE2  */
#define   PPS_EXTINT2R_EXTINT2_RPA4_Val       _UINT32_(0xA)                                        /* (PPS_EXTINT2R) RPA4  */
#define   PPS_EXTINT2R_EXTINT2_RPB3_Val       _UINT32_(0xB)                                        /* (PPS_EXTINT2R) RPB3  */
#define   PPS_EXTINT2R_EXTINT2_RPC1_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT2R) RPC1  */
#define   PPS_EXTINT2R_EXTINT2_RPD6_Val       _UINT32_(0xD)                                        /* (PPS_EXTINT2R) RPD6  */
#define   PPS_EXTINT2R_EXTINT2_RPE0_Val       _UINT32_(0xE)                                        /* (PPS_EXTINT2R) RPE0  */
#define   PPS_EXTINT2R_EXTINT2_RPA5_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT2R) RPA5  */
#define   PPS_EXTINT2R_EXTINT2_RPA9_Val       _UINT32_(0x10)                                       /* (PPS_EXTINT2R) RPA9  */
#define   PPS_EXTINT2R_EXTINT2_RPB6_Val       _UINT32_(0x11)                                       /* (PPS_EXTINT2R) RPB6  */
#define   PPS_EXTINT2R_EXTINT2_RPB10_Val      _UINT32_(0x12)                                       /* (PPS_EXTINT2R) RPB10  */
#define   PPS_EXTINT2R_EXTINT2_RPA0_Val       _UINT32_(0x13)                                       /* (PPS_EXTINT2R) RPA0  */
#define   PPS_EXTINT2R_EXTINT2_RPB1_Val       _UINT32_(0x14)                                       /* (PPS_EXTINT2R) RPB1  */
#define   PPS_EXTINT2R_EXTINT2_RPB5_Val       _UINT32_(0x15)                                       /* (PPS_EXTINT2R) RPB5  */
#define   PPS_EXTINT2R_EXTINT2_RPB9_Val       _UINT32_(0x16)                                       /* (PPS_EXTINT2R) RPB9  */
#define   PPS_EXTINT2R_EXTINT2_RPA1_Val       _UINT32_(0x17)                                       /* (PPS_EXTINT2R) RPA1  */
#define   PPS_EXTINT2R_EXTINT2_RPA12_Val      _UINT32_(0x18)                                       /* (PPS_EXTINT2R) RPA12  */
#define PPS_EXTINT2R_EXTINT2_OFF              (PPS_EXTINT2R_EXTINT2_OFF_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) OFF Position  */
#define PPS_EXTINT2R_EXTINT2_RPA2             (PPS_EXTINT2R_EXTINT2_RPA2_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA2 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA8             (PPS_EXTINT2R_EXTINT2_RPA8_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA8 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA13            (PPS_EXTINT2R_EXTINT2_RPA13_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA13 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB2             (PPS_EXTINT2R_EXTINT2_RPB2_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB2 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB8             (PPS_EXTINT2R_EXTINT2_RPB8_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB8 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB13            (PPS_EXTINT2R_EXTINT2_RPB13_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB13 Position  */
#define PPS_EXTINT2R_EXTINT2_RPC8             (PPS_EXTINT2R_EXTINT2_RPC8_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPC8 Position  */
#define PPS_EXTINT2R_EXTINT2_RPD2             (PPS_EXTINT2R_EXTINT2_RPD2_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPD2 Position  */
#define PPS_EXTINT2R_EXTINT2_RPE2             (PPS_EXTINT2R_EXTINT2_RPE2_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPE2 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA4             (PPS_EXTINT2R_EXTINT2_RPA4_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA4 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB3             (PPS_EXTINT2R_EXTINT2_RPB3_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB3 Position  */
#define PPS_EXTINT2R_EXTINT2_RPC1             (PPS_EXTINT2R_EXTINT2_RPC1_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPC1 Position  */
#define PPS_EXTINT2R_EXTINT2_RPD6             (PPS_EXTINT2R_EXTINT2_RPD6_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPD6 Position  */
#define PPS_EXTINT2R_EXTINT2_RPE0             (PPS_EXTINT2R_EXTINT2_RPE0_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPE0 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA5             (PPS_EXTINT2R_EXTINT2_RPA5_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA5 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA9             (PPS_EXTINT2R_EXTINT2_RPA9_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA9 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB6             (PPS_EXTINT2R_EXTINT2_RPB6_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB6 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB10            (PPS_EXTINT2R_EXTINT2_RPB10_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB10 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA0             (PPS_EXTINT2R_EXTINT2_RPA0_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA0 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB1             (PPS_EXTINT2R_EXTINT2_RPB1_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB1 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB5             (PPS_EXTINT2R_EXTINT2_RPB5_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB5 Position  */
#define PPS_EXTINT2R_EXTINT2_RPB9             (PPS_EXTINT2R_EXTINT2_RPB9_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPB9 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA1             (PPS_EXTINT2R_EXTINT2_RPA1_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA1 Position  */
#define PPS_EXTINT2R_EXTINT2_RPA12            (PPS_EXTINT2R_EXTINT2_RPA12_Val << PPS_EXTINT2R_EXTINT2_Pos) /* (PPS_EXTINT2R) RPA12 Position  */
#define PPS_EXTINT2R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_EXTINT2R) Register Mask  */


/* -------- PPS_EXTINT3R : (PPS Offset: 0x0C) (R/W 32)  -------- */
#define PPS_EXTINT3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_EXTINT3R)   Reset Value */

#define PPS_EXTINT3R_EXTINT3_Pos              _UINT32_(0)                                          /* (PPS_EXTINT3R) EXTINT3 Position */
#define PPS_EXTINT3R_EXTINT3_Msk              (_UINT32_(0x1F) << PPS_EXTINT3R_EXTINT3_Pos)         /* (PPS_EXTINT3R) EXTINT3 Mask */
#define PPS_EXTINT3R_EXTINT3(value)           (PPS_EXTINT3R_EXTINT3_Msk & (_UINT32_(value) << PPS_EXTINT3R_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the PPS_EXTINT3R register */
#define   PPS_EXTINT3R_EXTINT3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_EXTINT3R) OFF  */
#define   PPS_EXTINT3R_EXTINT3_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_EXTINT3R) RPA3  */
#define   PPS_EXTINT3R_EXTINT3_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_EXTINT3R) RPA9  */
#define   PPS_EXTINT3R_EXTINT3_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_EXTINT3R) RPA14  */
#define   PPS_EXTINT3R_EXTINT3_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_EXTINT3R) RPB3  */
#define   PPS_EXTINT3R_EXTINT3_RPC9_Val       _UINT32_(0x5)                                        /* (PPS_EXTINT3R) RPC9  */
#define   PPS_EXTINT3R_EXTINT3_RPD3_Val       _UINT32_(0x6)                                        /* (PPS_EXTINT3R) RPD3  */
#define   PPS_EXTINT3R_EXTINT3_RPE3_Val       _UINT32_(0x7)                                        /* (PPS_EXTINT3R) RPE3  */
#define   PPS_EXTINT3R_EXTINT3_RPA0_Val       _UINT32_(0x8)                                        /* (PPS_EXTINT3R) RPA0  */
#define   PPS_EXTINT3R_EXTINT3_RPB4_Val       _UINT32_(0x9)                                        /* (PPS_EXTINT3R) RPB4  */
#define   PPS_EXTINT3R_EXTINT3_RPC7_Val       _UINT32_(0xA)                                        /* (PPS_EXTINT3R) RPC7  */
#define   PPS_EXTINT3R_EXTINT3_RPD7_Val       _UINT32_(0xB)                                        /* (PPS_EXTINT3R) RPD7  */
#define   PPS_EXTINT3R_EXTINT3_RPE1_Val       _UINT32_(0xC)                                        /* (PPS_EXTINT3R) RPE1  */
#define   PPS_EXTINT3R_EXTINT3_RPA6_Val       _UINT32_(0xD)                                        /* (PPS_EXTINT3R) RPA6  */
#define   PPS_EXTINT3R_EXTINT3_RPA10_Val      _UINT32_(0xE)                                        /* (PPS_EXTINT3R) RPA10  */
#define   PPS_EXTINT3R_EXTINT3_RPB7_Val       _UINT32_(0xF)                                        /* (PPS_EXTINT3R) RPB7  */
#define   PPS_EXTINT3R_EXTINT3_RPB11_Val      _UINT32_(0x10)                                       /* (PPS_EXTINT3R) RPB11  */
#define   PPS_EXTINT3R_EXTINT3_RPA1_Val       _UINT32_(0x11)                                       /* (PPS_EXTINT3R) RPA1  */
#define   PPS_EXTINT3R_EXTINT3_RPA5_Val       _UINT32_(0x12)                                       /* (PPS_EXTINT3R) RPA5  */
#define   PPS_EXTINT3R_EXTINT3_RPA13_Val      _UINT32_(0x13)                                       /* (PPS_EXTINT3R) RPA13  */
#define   PPS_EXTINT3R_EXTINT3_RPB2_Val       _UINT32_(0x14)                                       /* (PPS_EXTINT3R) RPB2  */
#define   PPS_EXTINT3R_EXTINT3_RPB6_Val       _UINT32_(0x15)                                       /* (PPS_EXTINT3R) RPB6  */
#define   PPS_EXTINT3R_EXTINT3_RPB10_Val      _UINT32_(0x16)                                       /* (PPS_EXTINT3R) RPB10  */
#define   PPS_EXTINT3R_EXTINT3_RPA8_Val       _UINT32_(0x17)                                       /* (PPS_EXTINT3R) RPA8  */
#define   PPS_EXTINT3R_EXTINT3_RPA2_Val       _UINT32_(0x18)                                       /* (PPS_EXTINT3R) RPA2  */
#define PPS_EXTINT3R_EXTINT3_OFF              (PPS_EXTINT3R_EXTINT3_OFF_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) OFF Position  */
#define PPS_EXTINT3R_EXTINT3_RPA3             (PPS_EXTINT3R_EXTINT3_RPA3_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA3 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA9             (PPS_EXTINT3R_EXTINT3_RPA9_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA9 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA14            (PPS_EXTINT3R_EXTINT3_RPA14_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA14 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB3             (PPS_EXTINT3R_EXTINT3_RPB3_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB3 Position  */
#define PPS_EXTINT3R_EXTINT3_RPC9             (PPS_EXTINT3R_EXTINT3_RPC9_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPC9 Position  */
#define PPS_EXTINT3R_EXTINT3_RPD3             (PPS_EXTINT3R_EXTINT3_RPD3_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPD3 Position  */
#define PPS_EXTINT3R_EXTINT3_RPE3             (PPS_EXTINT3R_EXTINT3_RPE3_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPE3 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA0             (PPS_EXTINT3R_EXTINT3_RPA0_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA0 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB4             (PPS_EXTINT3R_EXTINT3_RPB4_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB4 Position  */
#define PPS_EXTINT3R_EXTINT3_RPC7             (PPS_EXTINT3R_EXTINT3_RPC7_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPC7 Position  */
#define PPS_EXTINT3R_EXTINT3_RPD7             (PPS_EXTINT3R_EXTINT3_RPD7_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPD7 Position  */
#define PPS_EXTINT3R_EXTINT3_RPE1             (PPS_EXTINT3R_EXTINT3_RPE1_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPE1 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA6             (PPS_EXTINT3R_EXTINT3_RPA6_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA6 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA10            (PPS_EXTINT3R_EXTINT3_RPA10_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA10 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB7             (PPS_EXTINT3R_EXTINT3_RPB7_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB7 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB11            (PPS_EXTINT3R_EXTINT3_RPB11_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB11 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA1             (PPS_EXTINT3R_EXTINT3_RPA1_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA1 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA5             (PPS_EXTINT3R_EXTINT3_RPA5_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA5 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA13            (PPS_EXTINT3R_EXTINT3_RPA13_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA13 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB2             (PPS_EXTINT3R_EXTINT3_RPB2_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB2 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB6             (PPS_EXTINT3R_EXTINT3_RPB6_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB6 Position  */
#define PPS_EXTINT3R_EXTINT3_RPB10            (PPS_EXTINT3R_EXTINT3_RPB10_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPB10 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA8             (PPS_EXTINT3R_EXTINT3_RPA8_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA8 Position  */
#define PPS_EXTINT3R_EXTINT3_RPA2             (PPS_EXTINT3R_EXTINT3_RPA2_Val << PPS_EXTINT3R_EXTINT3_Pos) /* (PPS_EXTINT3R) RPA2 Position  */
#define PPS_EXTINT3R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_EXTINT3R) Register Mask  */


