Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_SCOM1P2R_SCOM1P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P2R) SERCOM1/PAD2 Position */
#define PPS_SCOM1P2R_SCOM1P2_Msk              (_UINT32_(0x1F) << PPS_SCOM1P2R_SCOM1P2_Pos)         /* (PPS_SCOM1P2R) SERCOM1/PAD2 Mask */
#define PPS_SCOM1P2R_SCOM1P2(value)           (PPS_SCOM1P2R_SCOM1P2_Msk & (_UINT32_(value) << PPS_SCOM1P2R_SCOM1P2_Pos)) /* Assigment of value for SCOM1P2 in the PPS_SCOM1P2R register */
#define   PPS_SCOM1P2R_SCOM1P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P2R) OFF  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA0_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P2R) RPA0  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA6_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P2R) RPA6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_SCOM1P2R) RPA11  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_SCOM1P2R) RPB0  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P2R) RPB6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_SCOM1P2R) RPB11  */
#define   PPS_SCOM1P2R_SCOM1P2_RPC0_Val       _UINT32_(0x7)                                        /* (PPS_SCOM1P2R) RPC0  */
#define   PPS_SCOM1P2R_SCOM1P2_RPD6_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P2R) RPD6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPE0_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P2R) RPE0  */
#define   PPS_SCOM1P2R_SCOM1P2_RPE6_Val       _UINT32_(0xA)                                        /* (PPS_SCOM1P2R) RPE6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_SCOM1P2R) RPB1  */
#define   PPS_SCOM1P2R_SCOM1P2_RPC9_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P2R) RPC9  */
#define   PPS_SCOM1P2R_SCOM1P2_RPD3_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P2R) RPD3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPE4_Val       _UINT32_(0xE)                                        /* (PPS_SCOM1P2R) RPE4  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA3_Val       _UINT32_(0xF)                                        /* (PPS_SCOM1P2R) RPA3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA7_Val       _UINT32_(0x10)                                       /* (PPS_SCOM1P2R) RPA7  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB4_Val       _UINT32_(0x11)                                       /* (PPS_SCOM1P2R) RPB4  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB8_Val       _UINT32_(0x12)                                       /* (PPS_SCOM1P2R) RPB8  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB12_Val      _UINT32_(0x13)                                       /* (PPS_SCOM1P2R) RPB12  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA2_Val       _UINT32_(0x14)                                       /* (PPS_SCOM1P2R) RPA2  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA10_Val      _UINT32_(0x15)                                       /* (PPS_SCOM1P2R) RPA10  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA14_Val      _UINT32_(0x16)                                       /* (PPS_SCOM1P2R) RPA14  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB3_Val       _UINT32_(0x17)                                       /* (PPS_SCOM1P2R) RPB3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB7_Val       _UINT32_(0x18)                                       /* (PPS_SCOM1P2R) RPB7  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA9_Val       _UINT32_(0x19)                                       /* (PPS_SCOM1P2R) RPA9  */
#define PPS_SCOM1P2R_SCOM1P2_OFF              (PPS_SCOM1P2R_SCOM1P2_OFF_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) OFF Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA0             (PPS_SCOM1P2R_SCOM1P2_RPA0_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA0 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA6             (PPS_SCOM1P2R_SCOM1P2_RPA6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA11            (PPS_SCOM1P2R_SCOM1P2_RPA11_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA11 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB0             (PPS_SCOM1P2R_SCOM1P2_RPB0_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB0 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB6             (PPS_SCOM1P2R_SCOM1P2_RPB6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB11            (PPS_SCOM1P2R_SCOM1P2_RPB11_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB11 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPC0             (PPS_SCOM1P2R_SCOM1P2_RPC0_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPC0 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPD6             (PPS_SCOM1P2R_SCOM1P2_RPD6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPD6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPE0             (PPS_SCOM1P2R_SCOM1P2_RPE0_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPE0 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPE6             (PPS_SCOM1P2R_SCOM1P2_RPE6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPE6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB1             (PPS_SCOM1P2R_SCOM1P2_RPB1_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB1 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPC9             (PPS_SCOM1P2R_SCOM1P2_RPC9_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPC9 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPD3             (PPS_SCOM1P2R_SCOM1P2_RPD3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPD3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPE4             (PPS_SCOM1P2R_SCOM1P2_RPE4_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPE4 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA3             (PPS_SCOM1P2R_SCOM1P2_RPA3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA7             (PPS_SCOM1P2R_SCOM1P2_RPA7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB4             (PPS_SCOM1P2R_SCOM1P2_RPB4_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB4 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB8             (PPS_SCOM1P2R_SCOM1P2_RPB8_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB8 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB12            (PPS_SCOM1P2R_SCOM1P2_RPB12_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB12 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA2             (PPS_SCOM1P2R_SCOM1P2_RPA2_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA2 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA10            (PPS_SCOM1P2R_SCOM1P2_RPA10_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA10 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA14            (PPS_SCOM1P2R_SCOM1P2_RPA14_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA14 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB3             (PPS_SCOM1P2R_SCOM1P2_RPB3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB7             (PPS_SCOM1P2R_SCOM1P2_RPB7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA9             (PPS_SCOM1P2R_SCOM1P2_RPA9_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA9 Position  */
#define PPS_SCOM1P2R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM1P2R) Register Mask  */


/* -------- PPS_SCOM1P3R : (PPS Offset: 0x5C) (R/W 32)  -------- */
#define PPS_SCOM1P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P3R)   Reset Value */

