Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_SCOM2P2R_SCOM2P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM2P2R) SERCOM2/PAD2 Position */
#define PPS_SCOM2P2R_SCOM2P2_Msk              (_UINT32_(0x1F) << PPS_SCOM2P2R_SCOM2P2_Pos)         /* (PPS_SCOM2P2R) SERCOM2/PAD2 Mask */
#define PPS_SCOM2P2R_SCOM2P2(value)           (PPS_SCOM2P2R_SCOM2P2_Msk & (_UINT32_(value) << PPS_SCOM2P2R_SCOM2P2_Pos)) /* Assigment of value for SCOM2P2 in the PPS_SCOM2P2R register */
#define   PPS_SCOM2P2R_SCOM2P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM2P2R) OFF  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM2P2R) RPA3  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM2P2R) RPA9  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_SCOM2P2R) RPA14  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_SCOM2P2R) RPB3  */
#define   PPS_SCOM2P2R_SCOM2P2_RPC9_Val       _UINT32_(0x5)                                        /* (PPS_SCOM2P2R) RPC9  */
#define   PPS_SCOM2P2R_SCOM2P2_RPD3_Val       _UINT32_(0x6)                                        /* (PPS_SCOM2P2R) RPD3  */
#define   PPS_SCOM2P2R_SCOM2P2_RPE3_Val       _UINT32_(0x7)                                        /* (PPS_SCOM2P2R) RPE3  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA0_Val       _UINT32_(0x8)                                        /* (PPS_SCOM2P2R) RPA0  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB4_Val       _UINT32_(0x9)                                        /* (PPS_SCOM2P2R) RPB4  */
#define   PPS_SCOM2P2R_SCOM2P2_RPC7_Val       _UINT32_(0xA)                                        /* (PPS_SCOM2P2R) RPC7  */
#define   PPS_SCOM2P2R_SCOM2P2_RPD7_Val       _UINT32_(0xB)                                        /* (PPS_SCOM2P2R) RPD7  */
#define   PPS_SCOM2P2R_SCOM2P2_RPE1_Val       _UINT32_(0xC)                                        /* (PPS_SCOM2P2R) RPE1  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA6_Val       _UINT32_(0xD)                                        /* (PPS_SCOM2P2R) RPA6  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA10_Val      _UINT32_(0xE)                                        /* (PPS_SCOM2P2R) RPA10  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB7_Val       _UINT32_(0xF)                                        /* (PPS_SCOM2P2R) RPB7  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB11_Val      _UINT32_(0x10)                                       /* (PPS_SCOM2P2R) RPB11  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA1_Val       _UINT32_(0x11)                                       /* (PPS_SCOM2P2R) RPA1  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA5_Val       _UINT32_(0x12)                                       /* (PPS_SCOM2P2R) RPA5  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA13_Val      _UINT32_(0x13)                                       /* (PPS_SCOM2P2R) RPA13  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB2_Val       _UINT32_(0x14)                                       /* (PPS_SCOM2P2R) RPB2  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB6_Val       _UINT32_(0x15)                                       /* (PPS_SCOM2P2R) RPB6  */
#define   PPS_SCOM2P2R_SCOM2P2_RPB10_Val      _UINT32_(0x16)                                       /* (PPS_SCOM2P2R) RPB10  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA8_Val       _UINT32_(0x17)                                       /* (PPS_SCOM2P2R) RPA8  */
#define   PPS_SCOM2P2R_SCOM2P2_RPA2_Val       _UINT32_(0x18)                                       /* (PPS_SCOM2P2R) RPA2  */
#define PPS_SCOM2P2R_SCOM2P2_OFF              (PPS_SCOM2P2R_SCOM2P2_OFF_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) OFF Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA3             (PPS_SCOM2P2R_SCOM2P2_RPA3_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA3 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA9             (PPS_SCOM2P2R_SCOM2P2_RPA9_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA9 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA14            (PPS_SCOM2P2R_SCOM2P2_RPA14_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA14 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB3             (PPS_SCOM2P2R_SCOM2P2_RPB3_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB3 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPC9             (PPS_SCOM2P2R_SCOM2P2_RPC9_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPC9 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPD3             (PPS_SCOM2P2R_SCOM2P2_RPD3_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPD3 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPE3             (PPS_SCOM2P2R_SCOM2P2_RPE3_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPE3 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA0             (PPS_SCOM2P2R_SCOM2P2_RPA0_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA0 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB4             (PPS_SCOM2P2R_SCOM2P2_RPB4_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB4 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPC7             (PPS_SCOM2P2R_SCOM2P2_RPC7_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPC7 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPD7             (PPS_SCOM2P2R_SCOM2P2_RPD7_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPD7 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPE1             (PPS_SCOM2P2R_SCOM2P2_RPE1_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPE1 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA6             (PPS_SCOM2P2R_SCOM2P2_RPA6_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA6 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA10            (PPS_SCOM2P2R_SCOM2P2_RPA10_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA10 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB7             (PPS_SCOM2P2R_SCOM2P2_RPB7_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB7 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB11            (PPS_SCOM2P2R_SCOM2P2_RPB11_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB11 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA1             (PPS_SCOM2P2R_SCOM2P2_RPA1_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA1 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA5             (PPS_SCOM2P2R_SCOM2P2_RPA5_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA5 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA13            (PPS_SCOM2P2R_SCOM2P2_RPA13_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA13 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB2             (PPS_SCOM2P2R_SCOM2P2_RPB2_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB2 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB6             (PPS_SCOM2P2R_SCOM2P2_RPB6_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB6 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPB10            (PPS_SCOM2P2R_SCOM2P2_RPB10_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPB10 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA8             (PPS_SCOM2P2R_SCOM2P2_RPA8_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA8 Position  */
#define PPS_SCOM2P2R_SCOM2P2_RPA2             (PPS_SCOM2P2R_SCOM2P2_RPA2_Val << PPS_SCOM2P2R_SCOM2P2_Pos) /* (PPS_SCOM2P2R) RPA2 Position  */
#define PPS_SCOM2P2R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM2P2R) Register Mask  */


/* -------- PPS_SCOM2P3R : (PPS Offset: 0x6C) (R/W 32)  -------- */
#define PPS_SCOM2P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM2P3R)   Reset Value */

