Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_SCOM4P3R_SCOM4P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM4P3R) SERCOM4/PAD3 Position */
#define PPS_SCOM4P3R_SCOM4P3_Msk              (_UINT32_(0x1F) << PPS_SCOM4P3R_SCOM4P3_Pos)         /* (PPS_SCOM4P3R) SERCOM4/PAD3 Mask */
#define PPS_SCOM4P3R_SCOM4P3(value)           (PPS_SCOM4P3R_SCOM4P3_Msk & (_UINT32_(value) << PPS_SCOM4P3R_SCOM4P3_Pos)) /* Assigment of value for SCOM4P3 in the PPS_SCOM4P3R register */
#define   PPS_SCOM4P3R_SCOM4P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM4P3R) OFF  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA0_Val       _UINT32_(0x1)                                        /* (PPS_SCOM4P3R) RPA0  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA6_Val       _UINT32_(0x2)                                        /* (PPS_SCOM4P3R) RPA6  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_SCOM4P3R) RPA11  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_SCOM4P3R) RPB0  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM4P3R) RPB6  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_SCOM4P3R) RPB11  */
#define   PPS_SCOM4P3R_SCOM4P3_RPC0_Val       _UINT32_(0x7)                                        /* (PPS_SCOM4P3R) RPC0  */
#define   PPS_SCOM4P3R_SCOM4P3_RPD6_Val       _UINT32_(0x8)                                        /* (PPS_SCOM4P3R) RPD6  */
#define   PPS_SCOM4P3R_SCOM4P3_RPE0_Val       _UINT32_(0x9)                                        /* (PPS_SCOM4P3R) RPE0  */
#define   PPS_SCOM4P3R_SCOM4P3_RPE6_Val       _UINT32_(0xA)                                        /* (PPS_SCOM4P3R) RPE6  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_SCOM4P3R) RPB1  */
#define   PPS_SCOM4P3R_SCOM4P3_RPC9_Val       _UINT32_(0xC)                                        /* (PPS_SCOM4P3R) RPC9  */
#define   PPS_SCOM4P3R_SCOM4P3_RPD3_Val       _UINT32_(0xD)                                        /* (PPS_SCOM4P3R) RPD3  */
#define   PPS_SCOM4P3R_SCOM4P3_RPE4_Val       _UINT32_(0xE)                                        /* (PPS_SCOM4P3R) RPE4  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA3_Val       _UINT32_(0xF)                                        /* (PPS_SCOM4P3R) RPA3  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA7_Val       _UINT32_(0x10)                                       /* (PPS_SCOM4P3R) RPA7  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB4_Val       _UINT32_(0x11)                                       /* (PPS_SCOM4P3R) RPB4  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB8_Val       _UINT32_(0x12)                                       /* (PPS_SCOM4P3R) RPB8  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB12_Val      _UINT32_(0x13)                                       /* (PPS_SCOM4P3R) RPB12  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA2_Val       _UINT32_(0x14)                                       /* (PPS_SCOM4P3R) RPA2  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA10_Val      _UINT32_(0x15)                                       /* (PPS_SCOM4P3R) RPA10  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA14_Val      _UINT32_(0x16)                                       /* (PPS_SCOM4P3R) RPA14  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB3_Val       _UINT32_(0x17)                                       /* (PPS_SCOM4P3R) RPB3  */
#define   PPS_SCOM4P3R_SCOM4P3_RPB7_Val       _UINT32_(0x18)                                       /* (PPS_SCOM4P3R) RPB7  */
#define   PPS_SCOM4P3R_SCOM4P3_RPA9_Val       _UINT32_(0x19)                                       /* (PPS_SCOM4P3R) RPA9  */
#define PPS_SCOM4P3R_SCOM4P3_OFF              (PPS_SCOM4P3R_SCOM4P3_OFF_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) OFF Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA0             (PPS_SCOM4P3R_SCOM4P3_RPA0_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA0 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA6             (PPS_SCOM4P3R_SCOM4P3_RPA6_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA6 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA11            (PPS_SCOM4P3R_SCOM4P3_RPA11_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA11 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB0             (PPS_SCOM4P3R_SCOM4P3_RPB0_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB0 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB6             (PPS_SCOM4P3R_SCOM4P3_RPB6_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB6 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB11            (PPS_SCOM4P3R_SCOM4P3_RPB11_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB11 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPC0             (PPS_SCOM4P3R_SCOM4P3_RPC0_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPC0 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPD6             (PPS_SCOM4P3R_SCOM4P3_RPD6_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPD6 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPE0             (PPS_SCOM4P3R_SCOM4P3_RPE0_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPE0 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPE6             (PPS_SCOM4P3R_SCOM4P3_RPE6_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPE6 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB1             (PPS_SCOM4P3R_SCOM4P3_RPB1_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB1 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPC9             (PPS_SCOM4P3R_SCOM4P3_RPC9_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPC9 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPD3             (PPS_SCOM4P3R_SCOM4P3_RPD3_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPD3 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPE4             (PPS_SCOM4P3R_SCOM4P3_RPE4_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPE4 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA3             (PPS_SCOM4P3R_SCOM4P3_RPA3_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA3 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA7             (PPS_SCOM4P3R_SCOM4P3_RPA7_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA7 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB4             (PPS_SCOM4P3R_SCOM4P3_RPB4_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB4 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB8             (PPS_SCOM4P3R_SCOM4P3_RPB8_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB8 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB12            (PPS_SCOM4P3R_SCOM4P3_RPB12_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB12 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA2             (PPS_SCOM4P3R_SCOM4P3_RPA2_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA2 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA10            (PPS_SCOM4P3R_SCOM4P3_RPA10_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA10 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA14            (PPS_SCOM4P3R_SCOM4P3_RPA14_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA14 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB3             (PPS_SCOM4P3R_SCOM4P3_RPB3_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB3 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPB7             (PPS_SCOM4P3R_SCOM4P3_RPB7_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPB7 Position  */
#define PPS_SCOM4P3R_SCOM4P3_RPA9             (PPS_SCOM4P3R_SCOM4P3_RPA9_Val << PPS_SCOM4P3R_SCOM4P3_Pos) /* (PPS_SCOM4P3R) RPA9 Position  */
#define PPS_SCOM4P3R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM4P3R) Register Mask  */


/* -------- PPS_SCOM5P0R : (PPS Offset: 0x90) (R/W 32)  -------- */
#define PPS_SCOM5P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM5P0R)   Reset Value */

