Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
/* -------- PPS_SCOM5P3R : (PPS Offset: 0x9C) (R/W 32)  -------- */
#define PPS_SCOM5P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM5P3R)   Reset Value */

#define PPS_SCOM5P3R_SCOM5P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM5P3R) SERCOM5/PAD3 Position */
#define PPS_SCOM5P3R_SCOM5P3_Msk              (_UINT32_(0x1F) << PPS_SCOM5P3R_SCOM5P3_Pos)         /* (PPS_SCOM5P3R) SERCOM5/PAD3 Mask */
#define PPS_SCOM5P3R_SCOM5P3(value)           (PPS_SCOM5P3R_SCOM5P3_Msk & (_UINT32_(value) << PPS_SCOM5P3R_SCOM5P3_Pos)) /* Assigment of value for SCOM5P3 in the PPS_SCOM5P3R register */
#define   PPS_SCOM5P3R_SCOM5P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM5P3R) OFF  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA1_Val       _UINT32_(0x1)                                        /* (PPS_SCOM5P3R) RPA1  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM5P3R) RPA7  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_SCOM5P3R) RPA12  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_SCOM5P3R) RPB1  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM5P3R) RPB7  */
#define   PPS_SCOM5P3R_SCOM5P3_RPC1_Val       _UINT32_(0x6)                                        /* (PPS_SCOM5P3R) RPC1  */
#define   PPS_SCOM5P3R_SCOM5P3_RPC7_Val       _UINT32_(0x7)                                        /* (PPS_SCOM5P3R) RPC7  */
#define   PPS_SCOM5P3R_SCOM5P3_RPD7_Val       _UINT32_(0x8)                                        /* (PPS_SCOM5P3R) RPD7  */
#define   PPS_SCOM5P3R_SCOM5P3_RPE1_Val       _UINT32_(0x9)                                        /* (PPS_SCOM5P3R) RPE1  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA3_Val       _UINT32_(0xA)                                        /* (PPS_SCOM5P3R) RPA3  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_SCOM5P3R) RPB2  */
#define   PPS_SCOM5P3R_SCOM5P3_RPC0_Val       _UINT32_(0xC)                                        /* (PPS_SCOM5P3R) RPC0  */
#define   PPS_SCOM5P3R_SCOM5P3_RPD4_Val       _UINT32_(0xD)                                        /* (PPS_SCOM5P3R) RPD4  */
#define   PPS_SCOM5P3R_SCOM5P3_RPE6_Val       _UINT32_(0xE)                                        /* (PPS_SCOM5P3R) RPE6  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA4_Val       _UINT32_(0xF)                                        /* (PPS_SCOM5P3R) RPA4  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA8_Val       _UINT32_(0x10)                                       /* (PPS_SCOM5P3R) RPA8  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB12_Val      _UINT32_(0x11)                                       /* (PPS_SCOM5P3R) RPB12  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB5_Val       _UINT32_(0x12)                                       /* (PPS_SCOM5P3R) RPB5  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB9_Val       _UINT32_(0x13)                                       /* (PPS_SCOM5P3R) RPB9  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB13_Val      _UINT32_(0x14)                                       /* (PPS_SCOM5P3R) RPB13  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB0_Val       _UINT32_(0x15)                                       /* (PPS_SCOM5P3R) RPB0  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB4_Val       _UINT32_(0x16)                                       /* (PPS_SCOM5P3R) RPB4  */
#define   PPS_SCOM5P3R_SCOM5P3_RPB8_Val       _UINT32_(0x17)                                       /* (PPS_SCOM5P3R) RPB8  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA0_Val       _UINT32_(0x18)                                       /* (PPS_SCOM5P3R) RPA0  */
#define   PPS_SCOM5P3R_SCOM5P3_RPA11_Val      _UINT32_(0x19)                                       /* (PPS_SCOM5P3R) RPA11  */
#define PPS_SCOM5P3R_SCOM5P3_OFF              (PPS_SCOM5P3R_SCOM5P3_OFF_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) OFF Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA1             (PPS_SCOM5P3R_SCOM5P3_RPA1_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA1 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA7             (PPS_SCOM5P3R_SCOM5P3_RPA7_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA7 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA12            (PPS_SCOM5P3R_SCOM5P3_RPA12_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA12 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB1             (PPS_SCOM5P3R_SCOM5P3_RPB1_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB1 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB7             (PPS_SCOM5P3R_SCOM5P3_RPB7_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB7 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPC1             (PPS_SCOM5P3R_SCOM5P3_RPC1_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPC1 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPC7             (PPS_SCOM5P3R_SCOM5P3_RPC7_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPC7 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPD7             (PPS_SCOM5P3R_SCOM5P3_RPD7_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPD7 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPE1             (PPS_SCOM5P3R_SCOM5P3_RPE1_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPE1 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA3             (PPS_SCOM5P3R_SCOM5P3_RPA3_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA3 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB2             (PPS_SCOM5P3R_SCOM5P3_RPB2_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB2 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPC0             (PPS_SCOM5P3R_SCOM5P3_RPC0_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPC0 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPD4             (PPS_SCOM5P3R_SCOM5P3_RPD4_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPD4 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPE6             (PPS_SCOM5P3R_SCOM5P3_RPE6_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPE6 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA4             (PPS_SCOM5P3R_SCOM5P3_RPA4_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA4 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA8             (PPS_SCOM5P3R_SCOM5P3_RPA8_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA8 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB12            (PPS_SCOM5P3R_SCOM5P3_RPB12_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB12 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB5             (PPS_SCOM5P3R_SCOM5P3_RPB5_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB5 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB9             (PPS_SCOM5P3R_SCOM5P3_RPB9_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB9 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB13            (PPS_SCOM5P3R_SCOM5P3_RPB13_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB13 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB0             (PPS_SCOM5P3R_SCOM5P3_RPB0_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB0 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB4             (PPS_SCOM5P3R_SCOM5P3_RPB4_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB4 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPB8             (PPS_SCOM5P3R_SCOM5P3_RPB8_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPB8 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA0             (PPS_SCOM5P3R_SCOM5P3_RPA0_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA0 Position  */
#define PPS_SCOM5P3R_SCOM5P3_RPA11            (PPS_SCOM5P3R_SCOM5P3_RPA11_Val << PPS_SCOM5P3R_SCOM5P3_Pos) /* (PPS_SCOM5P3R) RPA11 Position  */
#define PPS_SCOM5P3R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM5P3R) Register Mask  */


/* -------- PPS_QD0R : (PPS Offset: 0xA0) (R/W 32)  -------- */
#define PPS_QD0R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD0R)   Reset Value */

#define PPS_QD0R_QD0_Pos                      _UINT32_(0)                                          /* (PPS_QD0R) QD0 Position */
#define PPS_QD0R_QD0_Msk                      (_UINT32_(0x1F) << PPS_QD0R_QD0_Pos)                 /* (PPS_QD0R) QD0 Mask */
#define PPS_QD0R_QD0(value)                   (PPS_QD0R_QD0_Msk & (_UINT32_(value) << PPS_QD0R_QD0_Pos)) /* Assigment of value for QD0 in the PPS_QD0R register */
#define   PPS_QD0R_QD0_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD0R) OFF  */
#define   PPS_QD0R_QD0_RPA3_Val               _UINT32_(0x1)                                        /* (PPS_QD0R) RPA3  */
#define   PPS_QD0R_QD0_RPA9_Val               _UINT32_(0x2)                                        /* (PPS_QD0R) RPA9  */
#define   PPS_QD0R_QD0_RPA14_Val              _UINT32_(0x3)                                        /* (PPS_QD0R) RPA14  */
#define   PPS_QD0R_QD0_RPB3_Val               _UINT32_(0x4)                                        /* (PPS_QD0R) RPB3  */
#define   PPS_QD0R_QD0_RPC9_Val               _UINT32_(0x5)                                        /* (PPS_QD0R) RPC9  */
#define   PPS_QD0R_QD0_RPD3_Val               _UINT32_(0x6)                                        /* (PPS_QD0R) RPD3  */
#define   PPS_QD0R_QD0_RPE3_Val               _UINT32_(0x7)                                        /* (PPS_QD0R) RPE3  */
#define   PPS_QD0R_QD0_RPA0_Val               _UINT32_(0x8)                                        /* (PPS_QD0R) RPA0  */
#define   PPS_QD0R_QD0_RPB4_Val               _UINT32_(0x9)                                        /* (PPS_QD0R) RPB4  */
#define   PPS_QD0R_QD0_RPC7_Val               _UINT32_(0xA)                                        /* (PPS_QD0R) RPC7  */
#define   PPS_QD0R_QD0_RPD7_Val               _UINT32_(0xB)                                        /* (PPS_QD0R) RPD7  */
#define   PPS_QD0R_QD0_RPE1_Val               _UINT32_(0xC)                                        /* (PPS_QD0R) RPE1  */
#define   PPS_QD0R_QD0_RPA6_Val               _UINT32_(0xD)                                        /* (PPS_QD0R) RPA6  */
#define   PPS_QD0R_QD0_RPA10_Val              _UINT32_(0xE)                                        /* (PPS_QD0R) RPA10  */
#define   PPS_QD0R_QD0_RPB7_Val               _UINT32_(0xF)                                        /* (PPS_QD0R) RPB7  */
#define   PPS_QD0R_QD0_RPB11_Val              _UINT32_(0x10)                                       /* (PPS_QD0R) RPB11  */
#define   PPS_QD0R_QD0_RPA1_Val               _UINT32_(0x11)                                       /* (PPS_QD0R) RPA1  */
#define   PPS_QD0R_QD0_RPA5_Val               _UINT32_(0x12)                                       /* (PPS_QD0R) RPA5  */
#define   PPS_QD0R_QD0_RPA13_Val              _UINT32_(0x13)                                       /* (PPS_QD0R) RPA13  */
#define   PPS_QD0R_QD0_RPB2_Val               _UINT32_(0x14)                                       /* (PPS_QD0R) RPB2  */
#define   PPS_QD0R_QD0_RPB6_Val               _UINT32_(0x15)                                       /* (PPS_QD0R) RPB6  */
#define   PPS_QD0R_QD0_RPB10_Val              _UINT32_(0x16)                                       /* (PPS_QD0R) RPB10  */
#define   PPS_QD0R_QD0_RPA8_Val               _UINT32_(0x17)                                       /* (PPS_QD0R) RPA8  */
#define   PPS_QD0R_QD0_RPA2_Val               _UINT32_(0x18)                                       /* (PPS_QD0R) RPA2  */
#define PPS_QD0R_QD0_OFF                      (PPS_QD0R_QD0_OFF_Val << PPS_QD0R_QD0_Pos)           /* (PPS_QD0R) OFF Position  */
#define PPS_QD0R_QD0_RPA3                     (PPS_QD0R_QD0_RPA3_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA3 Position  */
#define PPS_QD0R_QD0_RPA9                     (PPS_QD0R_QD0_RPA9_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA9 Position  */
#define PPS_QD0R_QD0_RPA14                    (PPS_QD0R_QD0_RPA14_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPA14 Position  */
#define PPS_QD0R_QD0_RPB3                     (PPS_QD0R_QD0_RPB3_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB3 Position  */
#define PPS_QD0R_QD0_RPC9                     (PPS_QD0R_QD0_RPC9_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPC9 Position  */
#define PPS_QD0R_QD0_RPD3                     (PPS_QD0R_QD0_RPD3_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPD3 Position  */
#define PPS_QD0R_QD0_RPE3                     (PPS_QD0R_QD0_RPE3_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPE3 Position  */
#define PPS_QD0R_QD0_RPA0                     (PPS_QD0R_QD0_RPA0_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA0 Position  */
#define PPS_QD0R_QD0_RPB4                     (PPS_QD0R_QD0_RPB4_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB4 Position  */
#define PPS_QD0R_QD0_RPC7                     (PPS_QD0R_QD0_RPC7_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPC7 Position  */
#define PPS_QD0R_QD0_RPD7                     (PPS_QD0R_QD0_RPD7_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPD7 Position  */
#define PPS_QD0R_QD0_RPE1                     (PPS_QD0R_QD0_RPE1_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPE1 Position  */
#define PPS_QD0R_QD0_RPA6                     (PPS_QD0R_QD0_RPA6_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA6 Position  */
#define PPS_QD0R_QD0_RPA10                    (PPS_QD0R_QD0_RPA10_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPA10 Position  */
#define PPS_QD0R_QD0_RPB7                     (PPS_QD0R_QD0_RPB7_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB7 Position  */
#define PPS_QD0R_QD0_RPB11                    (PPS_QD0R_QD0_RPB11_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPB11 Position  */
#define PPS_QD0R_QD0_RPA1                     (PPS_QD0R_QD0_RPA1_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA1 Position  */
#define PPS_QD0R_QD0_RPA5                     (PPS_QD0R_QD0_RPA5_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA5 Position  */
#define PPS_QD0R_QD0_RPA13                    (PPS_QD0R_QD0_RPA13_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPA13 Position  */
#define PPS_QD0R_QD0_RPB2                     (PPS_QD0R_QD0_RPB2_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB2 Position  */
#define PPS_QD0R_QD0_RPB6                     (PPS_QD0R_QD0_RPB6_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB6 Position  */
#define PPS_QD0R_QD0_RPB10                    (PPS_QD0R_QD0_RPB10_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPB10 Position  */
#define PPS_QD0R_QD0_RPA8                     (PPS_QD0R_QD0_RPA8_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA8 Position  */
#define PPS_QD0R_QD0_RPA2                     (PPS_QD0R_QD0_RPA2_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA2 Position  */
#define PPS_QD0R_Msk                          _UINT32_(0x0000001F)                                 /* (PPS_QD0R) Register Mask  */


/* -------- PPS_QD1R : (PPS Offset: 0xA4) (R/W 32)  -------- */
#define PPS_QD1R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD1R)   Reset Value */

