Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_QD2R_QD2_Pos                      _UINT32_(0)                                          /* (PPS_QD2R) QD2 Position */
#define PPS_QD2R_QD2_Msk                      (_UINT32_(0x1F) << PPS_QD2R_QD2_Pos)                 /* (PPS_QD2R) QD2 Mask */
#define PPS_QD2R_QD2(value)                   (PPS_QD2R_QD2_Msk & (_UINT32_(value) << PPS_QD2R_QD2_Pos)) /* Assigment of value for QD2 in the PPS_QD2R register */
#define   PPS_QD2R_QD2_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD2R) OFF  */
#define   PPS_QD2R_QD2_RPA1_Val               _UINT32_(0x1)                                        /* (PPS_QD2R) RPA1  */
#define   PPS_QD2R_QD2_RPA7_Val               _UINT32_(0x2)                                        /* (PPS_QD2R) RPA7  */
#define   PPS_QD2R_QD2_RPA12_Val              _UINT32_(0x3)                                        /* (PPS_QD2R) RPA12  */
#define   PPS_QD2R_QD2_RPB1_Val               _UINT32_(0x4)                                        /* (PPS_QD2R) RPB1  */
#define   PPS_QD2R_QD2_RPB7_Val               _UINT32_(0x5)                                        /* (PPS_QD2R) RPB7  */
#define   PPS_QD2R_QD2_RPC1_Val               _UINT32_(0x6)                                        /* (PPS_QD2R) RPC1  */
#define   PPS_QD2R_QD2_RPC7_Val               _UINT32_(0x7)                                        /* (PPS_QD2R) RPC7  */
#define   PPS_QD2R_QD2_RPD7_Val               _UINT32_(0x8)                                        /* (PPS_QD2R) RPD7  */
#define   PPS_QD2R_QD2_RPE1_Val               _UINT32_(0x9)                                        /* (PPS_QD2R) RPE1  */
#define   PPS_QD2R_QD2_RPA3_Val               _UINT32_(0xA)                                        /* (PPS_QD2R) RPA3  */
#define   PPS_QD2R_QD2_RPB2_Val               _UINT32_(0xB)                                        /* (PPS_QD2R) RPB2  */
#define   PPS_QD2R_QD2_RPC0_Val               _UINT32_(0xC)                                        /* (PPS_QD2R) RPC0  */
#define   PPS_QD2R_QD2_RPD4_Val               _UINT32_(0xD)                                        /* (PPS_QD2R) RPD4  */
#define   PPS_QD2R_QD2_RPE6_Val               _UINT32_(0xE)                                        /* (PPS_QD2R) RPE6  */
#define   PPS_QD2R_QD2_RPA4_Val               _UINT32_(0xF)                                        /* (PPS_QD2R) RPA4  */
#define   PPS_QD2R_QD2_RPA8_Val               _UINT32_(0x10)                                       /* (PPS_QD2R) RPA8  */
#define   PPS_QD2R_QD2_RPB12_Val              _UINT32_(0x11)                                       /* (PPS_QD2R) RPB12  */
#define   PPS_QD2R_QD2_RPB5_Val               _UINT32_(0x12)                                       /* (PPS_QD2R) RPB5  */
#define   PPS_QD2R_QD2_RPB9_Val               _UINT32_(0x13)                                       /* (PPS_QD2R) RPB9  */
#define   PPS_QD2R_QD2_RPB13_Val              _UINT32_(0x14)                                       /* (PPS_QD2R) RPB13  */
#define   PPS_QD2R_QD2_RPB0_Val               _UINT32_(0x15)                                       /* (PPS_QD2R) RPB0  */
#define   PPS_QD2R_QD2_RPB4_Val               _UINT32_(0x16)                                       /* (PPS_QD2R) RPB4  */
#define   PPS_QD2R_QD2_RPB8_Val               _UINT32_(0x17)                                       /* (PPS_QD2R) RPB8  */
#define   PPS_QD2R_QD2_RPA0_Val               _UINT32_(0x18)                                       /* (PPS_QD2R) RPA0  */
#define   PPS_QD2R_QD2_RPA11_Val              _UINT32_(0x19)                                       /* (PPS_QD2R) RPA11  */
#define PPS_QD2R_QD2_OFF                      (PPS_QD2R_QD2_OFF_Val << PPS_QD2R_QD2_Pos)           /* (PPS_QD2R) OFF Position  */
#define PPS_QD2R_QD2_RPA1                     (PPS_QD2R_QD2_RPA1_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA1 Position  */
#define PPS_QD2R_QD2_RPA7                     (PPS_QD2R_QD2_RPA7_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA7 Position  */
#define PPS_QD2R_QD2_RPA12                    (PPS_QD2R_QD2_RPA12_Val << PPS_QD2R_QD2_Pos)         /* (PPS_QD2R) RPA12 Position  */
#define PPS_QD2R_QD2_RPB1                     (PPS_QD2R_QD2_RPB1_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB1 Position  */
#define PPS_QD2R_QD2_RPB7                     (PPS_QD2R_QD2_RPB7_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB7 Position  */
#define PPS_QD2R_QD2_RPC1                     (PPS_QD2R_QD2_RPC1_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPC1 Position  */
#define PPS_QD2R_QD2_RPC7                     (PPS_QD2R_QD2_RPC7_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPC7 Position  */
#define PPS_QD2R_QD2_RPD7                     (PPS_QD2R_QD2_RPD7_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPD7 Position  */
#define PPS_QD2R_QD2_RPE1                     (PPS_QD2R_QD2_RPE1_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPE1 Position  */
#define PPS_QD2R_QD2_RPA3                     (PPS_QD2R_QD2_RPA3_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA3 Position  */
#define PPS_QD2R_QD2_RPB2                     (PPS_QD2R_QD2_RPB2_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB2 Position  */
#define PPS_QD2R_QD2_RPC0                     (PPS_QD2R_QD2_RPC0_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPC0 Position  */
#define PPS_QD2R_QD2_RPD4                     (PPS_QD2R_QD2_RPD4_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPD4 Position  */
#define PPS_QD2R_QD2_RPE6                     (PPS_QD2R_QD2_RPE6_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPE6 Position  */
#define PPS_QD2R_QD2_RPA4                     (PPS_QD2R_QD2_RPA4_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA4 Position  */
#define PPS_QD2R_QD2_RPA8                     (PPS_QD2R_QD2_RPA8_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA8 Position  */
#define PPS_QD2R_QD2_RPB12                    (PPS_QD2R_QD2_RPB12_Val << PPS_QD2R_QD2_Pos)         /* (PPS_QD2R) RPB12 Position  */
#define PPS_QD2R_QD2_RPB5                     (PPS_QD2R_QD2_RPB5_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB5 Position  */
#define PPS_QD2R_QD2_RPB9                     (PPS_QD2R_QD2_RPB9_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB9 Position  */
#define PPS_QD2R_QD2_RPB13                    (PPS_QD2R_QD2_RPB13_Val << PPS_QD2R_QD2_Pos)         /* (PPS_QD2R) RPB13 Position  */
#define PPS_QD2R_QD2_RPB0                     (PPS_QD2R_QD2_RPB0_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB0 Position  */
#define PPS_QD2R_QD2_RPB4                     (PPS_QD2R_QD2_RPB4_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB4 Position  */
#define PPS_QD2R_QD2_RPB8                     (PPS_QD2R_QD2_RPB8_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB8 Position  */
#define PPS_QD2R_QD2_RPA0                     (PPS_QD2R_QD2_RPA0_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA0 Position  */
#define PPS_QD2R_QD2_RPA11                    (PPS_QD2R_QD2_RPA11_Val << PPS_QD2R_QD2_Pos)         /* (PPS_QD2R) RPA11 Position  */
#define PPS_QD2R_Msk                          _UINT32_(0x0000001F)                                 /* (PPS_QD2R) Register Mask  */


/* -------- PPS_QD3R : (PPS Offset: 0xAC) (R/W 32)  -------- */
#define PPS_QD3R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD3R)   Reset Value */

#define PPS_QD3R_QD3_Pos                      _UINT32_(0)                                          /* (PPS_QD3R) QD3 Position */
#define PPS_QD3R_QD3_Msk                      (_UINT32_(0x1F) << PPS_QD3R_QD3_Pos)                 /* (PPS_QD3R) QD3 Mask */
#define PPS_QD3R_QD3(value)                   (PPS_QD3R_QD3_Msk & (_UINT32_(value) << PPS_QD3R_QD3_Pos)) /* Assigment of value for QD3 in the PPS_QD3R register */
#define   PPS_QD3R_QD3_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD3R) OFF  */
#define   PPS_QD3R_QD3_RPA2_Val               _UINT32_(0x1)                                        /* (PPS_QD3R) RPA2  */
#define   PPS_QD3R_QD3_RPA8_Val               _UINT32_(0x2)                                        /* (PPS_QD3R) RPA8  */
#define   PPS_QD3R_QD3_RPA13_Val              _UINT32_(0x3)                                        /* (PPS_QD3R) RPA13  */
#define   PPS_QD3R_QD3_RPB2_Val               _UINT32_(0x4)                                        /* (PPS_QD3R) RPB2  */
#define   PPS_QD3R_QD3_RPB8_Val               _UINT32_(0x5)                                        /* (PPS_QD3R) RPB8  */
#define   PPS_QD3R_QD3_RPB13_Val              _UINT32_(0x6)                                        /* (PPS_QD3R) RPB13  */
#define   PPS_QD3R_QD3_RPC8_Val               _UINT32_(0x7)                                        /* (PPS_QD3R) RPC8  */
#define   PPS_QD3R_QD3_RPD2_Val               _UINT32_(0x8)                                        /* (PPS_QD3R) RPD2  */
#define   PPS_QD3R_QD3_RPE2_Val               _UINT32_(0x9)                                        /* (PPS_QD3R) RPE2  */
#define   PPS_QD3R_QD3_RPA4_Val               _UINT32_(0xA)                                        /* (PPS_QD3R) RPA4  */
#define   PPS_QD3R_QD3_RPB3_Val               _UINT32_(0xB)                                        /* (PPS_QD3R) RPB3  */
#define   PPS_QD3R_QD3_RPC1_Val               _UINT32_(0xC)                                        /* (PPS_QD3R) RPC1  */
#define   PPS_QD3R_QD3_RPD6_Val               _UINT32_(0xD)                                        /* (PPS_QD3R) RPD6  */
#define   PPS_QD3R_QD3_RPE0_Val               _UINT32_(0xE)                                        /* (PPS_QD3R) RPE0  */
#define   PPS_QD3R_QD3_RPA5_Val               _UINT32_(0xF)                                        /* (PPS_QD3R) RPA5  */
#define   PPS_QD3R_QD3_RPA9_Val               _UINT32_(0x10)                                       /* (PPS_QD3R) RPA9  */
#define   PPS_QD3R_QD3_RPB6_Val               _UINT32_(0x11)                                       /* (PPS_QD3R) RPB6  */
#define   PPS_QD3R_QD3_RPB10_Val              _UINT32_(0x12)                                       /* (PPS_QD3R) RPB10  */
#define   PPS_QD3R_QD3_RPA0_Val               _UINT32_(0x13)                                       /* (PPS_QD3R) RPA0  */
#define   PPS_QD3R_QD3_RPB1_Val               _UINT32_(0x14)                                       /* (PPS_QD3R) RPB1  */
#define   PPS_QD3R_QD3_RPB5_Val               _UINT32_(0x15)                                       /* (PPS_QD3R) RPB5  */
#define   PPS_QD3R_QD3_RPB9_Val               _UINT32_(0x16)                                       /* (PPS_QD3R) RPB9  */
#define   PPS_QD3R_QD3_RPA1_Val               _UINT32_(0x17)                                       /* (PPS_QD3R) RPA1  */
#define   PPS_QD3R_QD3_RPA12_Val              _UINT32_(0x18)                                       /* (PPS_QD3R) RPA12  */
#define PPS_QD3R_QD3_OFF                      (PPS_QD3R_QD3_OFF_Val << PPS_QD3R_QD3_Pos)           /* (PPS_QD3R) OFF Position  */
#define PPS_QD3R_QD3_RPA2                     (PPS_QD3R_QD3_RPA2_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA2 Position  */
#define PPS_QD3R_QD3_RPA8                     (PPS_QD3R_QD3_RPA8_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA8 Position  */
#define PPS_QD3R_QD3_RPA13                    (PPS_QD3R_QD3_RPA13_Val << PPS_QD3R_QD3_Pos)         /* (PPS_QD3R) RPA13 Position  */
#define PPS_QD3R_QD3_RPB2                     (PPS_QD3R_QD3_RPB2_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB2 Position  */
#define PPS_QD3R_QD3_RPB8                     (PPS_QD3R_QD3_RPB8_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB8 Position  */
#define PPS_QD3R_QD3_RPB13                    (PPS_QD3R_QD3_RPB13_Val << PPS_QD3R_QD3_Pos)         /* (PPS_QD3R) RPB13 Position  */
#define PPS_QD3R_QD3_RPC8                     (PPS_QD3R_QD3_RPC8_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPC8 Position  */
#define PPS_QD3R_QD3_RPD2                     (PPS_QD3R_QD3_RPD2_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPD2 Position  */
#define PPS_QD3R_QD3_RPE2                     (PPS_QD3R_QD3_RPE2_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPE2 Position  */
#define PPS_QD3R_QD3_RPA4                     (PPS_QD3R_QD3_RPA4_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA4 Position  */
#define PPS_QD3R_QD3_RPB3                     (PPS_QD3R_QD3_RPB3_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB3 Position  */
#define PPS_QD3R_QD3_RPC1                     (PPS_QD3R_QD3_RPC1_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPC1 Position  */
#define PPS_QD3R_QD3_RPD6                     (PPS_QD3R_QD3_RPD6_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPD6 Position  */
#define PPS_QD3R_QD3_RPE0                     (PPS_QD3R_QD3_RPE0_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPE0 Position  */
#define PPS_QD3R_QD3_RPA5                     (PPS_QD3R_QD3_RPA5_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA5 Position  */
#define PPS_QD3R_QD3_RPA9                     (PPS_QD3R_QD3_RPA9_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA9 Position  */
#define PPS_QD3R_QD3_RPB6                     (PPS_QD3R_QD3_RPB6_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB6 Position  */
#define PPS_QD3R_QD3_RPB10                    (PPS_QD3R_QD3_RPB10_Val << PPS_QD3R_QD3_Pos)         /* (PPS_QD3R) RPB10 Position  */
#define PPS_QD3R_QD3_RPA0                     (PPS_QD3R_QD3_RPA0_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA0 Position  */
#define PPS_QD3R_QD3_RPB1                     (PPS_QD3R_QD3_RPB1_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB1 Position  */
#define PPS_QD3R_QD3_RPB5                     (PPS_QD3R_QD3_RPB5_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB5 Position  */
#define PPS_QD3R_QD3_RPB9                     (PPS_QD3R_QD3_RPB9_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPB9 Position  */
#define PPS_QD3R_QD3_RPA1                     (PPS_QD3R_QD3_RPA1_Val << PPS_QD3R_QD3_Pos)          /* (PPS_QD3R) RPA1 Position  */
#define PPS_QD3R_QD3_RPA12                    (PPS_QD3R_QD3_RPA12_Val << PPS_QD3R_QD3_Pos)         /* (PPS_QD3R) RPA12 Position  */
#define PPS_QD3R_Msk                          _UINT32_(0x0000001F)                                 /* (PPS_QD3R) Register Mask  */


/* -------- PPS_REFIR : (PPS Offset: 0xB0) (R/W 32)  -------- */
#define PPS_REFIR_RESETVALUE                  _UINT32_(0x00)                                       /*  (PPS_REFIR)   Reset Value */

#define PPS_REFIR_REFI_Pos                    _UINT32_(0)                                          /* (PPS_REFIR) REFI Position */
#define PPS_REFIR_REFI_Msk                    (_UINT32_(0x1F) << PPS_REFIR_REFI_Pos)               /* (PPS_REFIR) REFI Mask */
#define PPS_REFIR_REFI(value)                 (PPS_REFIR_REFI_Msk & (_UINT32_(value) << PPS_REFIR_REFI_Pos)) /* Assigment of value for REFI in the PPS_REFIR register */
#define   PPS_REFIR_REFI_OFF_Val              _UINT32_(0x0)                                        /* (PPS_REFIR) OFF  */
#define   PPS_REFIR_REFI_RPA5_Val             _UINT32_(0x1)                                        /* (PPS_REFIR) RPA5  */
#define   PPS_REFIR_REFI_RPB5_Val             _UINT32_(0x2)                                        /* (PPS_REFIR) RPB5  */
#define   PPS_REFIR_REFI_RPB9_Val             _UINT32_(0x3)                                        /* (PPS_REFIR) RPB9  */
#define   PPS_REFIR_REFI_RPD5_Val             _UINT32_(0x4)                                        /* (PPS_REFIR) RPD5  */
#define   PPS_REFIR_REFI_RPE5_Val             _UINT32_(0x5)                                        /* (PPS_REFIR) RPE5  */
#define   PPS_REFIR_REFI_RPA3_Val             _UINT32_(0x6)                                        /* (PPS_REFIR) RPA3  */
#define   PPS_REFIR_REFI_RPA6_Val             _UINT32_(0x7)                                        /* (PPS_REFIR) RPA6  */
#define   PPS_REFIR_REFI_RPA7_Val             _UINT32_(0x8)                                        /* (PPS_REFIR) RPA7  */
#define   PPS_REFIR_REFI_RPB6_Val             _UINT32_(0x9)                                        /* (PPS_REFIR) RPB6  */
#define   PPS_REFIR_REFI_RPB8_Val             _UINT32_(0xA)                                        /* (PPS_REFIR) RPB8  */
#define PPS_REFIR_REFI_OFF                    (PPS_REFIR_REFI_OFF_Val << PPS_REFIR_REFI_Pos)       /* (PPS_REFIR) OFF Position  */
#define PPS_REFIR_REFI_RPA5                   (PPS_REFIR_REFI_RPA5_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPA5 Position  */
#define PPS_REFIR_REFI_RPB5                   (PPS_REFIR_REFI_RPB5_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPB5 Position  */
#define PPS_REFIR_REFI_RPB9                   (PPS_REFIR_REFI_RPB9_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPB9 Position  */
#define PPS_REFIR_REFI_RPD5                   (PPS_REFIR_REFI_RPD5_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPD5 Position  */
#define PPS_REFIR_REFI_RPE5                   (PPS_REFIR_REFI_RPE5_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPE5 Position  */
#define PPS_REFIR_REFI_RPA3                   (PPS_REFIR_REFI_RPA3_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPA3 Position  */
#define PPS_REFIR_REFI_RPA6                   (PPS_REFIR_REFI_RPA6_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPA6 Position  */
#define PPS_REFIR_REFI_RPA7                   (PPS_REFIR_REFI_RPA7_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPA7 Position  */
#define PPS_REFIR_REFI_RPB6                   (PPS_REFIR_REFI_RPB6_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPB6 Position  */
#define PPS_REFIR_REFI_RPB8                   (PPS_REFIR_REFI_RPB8_Val << PPS_REFIR_REFI_Pos)      /* (PPS_REFIR) RPB8 Position  */
#define PPS_REFIR_Msk                         _UINT32_(0x0000001F)                                 /* (PPS_REFIR) Register Mask  */


