Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
/* -------- PPS_CCLIN5R : (PPS Offset: 0xC8) (R/W 32)  -------- */
#define PPS_CCLIN5R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN5R)   Reset Value */

#define PPS_CCLIN5R_CCLIN5_Pos                _UINT32_(0)                                          /* (PPS_CCLIN5R) CCL/IN5 Position */
#define PPS_CCLIN5R_CCLIN5_Msk                (_UINT32_(0x1F) << PPS_CCLIN5R_CCLIN5_Pos)           /* (PPS_CCLIN5R) CCL/IN5 Mask */
#define PPS_CCLIN5R_CCLIN5(value)             (PPS_CCLIN5R_CCLIN5_Msk & (_UINT32_(value) << PPS_CCLIN5R_CCLIN5_Pos)) /* Assigment of value for CCLIN5 in the PPS_CCLIN5R register */
#define   PPS_CCLIN5R_CCLIN5_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN5R) OFF  */
#define   PPS_CCLIN5R_CCLIN5_RPA2_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN5R) RPA2  */
#define   PPS_CCLIN5R_CCLIN5_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN5R) RPA8  */
#define   PPS_CCLIN5R_CCLIN5_RPA13_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN5R) RPA13  */
#define   PPS_CCLIN5R_CCLIN5_RPB2_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN5R) RPB2  */
#define   PPS_CCLIN5R_CCLIN5_RPB8_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN5R) RPB8  */
#define   PPS_CCLIN5R_CCLIN5_RPB13_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN5R) RPB13  */
#define   PPS_CCLIN5R_CCLIN5_RPC8_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN5R) RPC8  */
#define   PPS_CCLIN5R_CCLIN5_RPD2_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN5R) RPD2  */
#define   PPS_CCLIN5R_CCLIN5_RPE2_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN5R) RPE2  */
#define   PPS_CCLIN5R_CCLIN5_RPA4_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN5R) RPA4  */
#define   PPS_CCLIN5R_CCLIN5_RPB3_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN5R) RPB3  */
#define   PPS_CCLIN5R_CCLIN5_RPC1_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN5R) RPC1  */
#define   PPS_CCLIN5R_CCLIN5_RPD6_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN5R) RPD6  */
#define   PPS_CCLIN5R_CCLIN5_RPE0_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN5R) RPE0  */
#define   PPS_CCLIN5R_CCLIN5_RPA5_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN5R) RPA5  */
#define   PPS_CCLIN5R_CCLIN5_RPA9_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN5R) RPA9  */
#define   PPS_CCLIN5R_CCLIN5_RPB6_Val         _UINT32_(0x11)                                       /* (PPS_CCLIN5R) RPB6  */
#define   PPS_CCLIN5R_CCLIN5_RPB10_Val        _UINT32_(0x12)                                       /* (PPS_CCLIN5R) RPB10  */
#define   PPS_CCLIN5R_CCLIN5_RPA0_Val         _UINT32_(0x13)                                       /* (PPS_CCLIN5R) RPA0  */
#define   PPS_CCLIN5R_CCLIN5_RPB1_Val         _UINT32_(0x14)                                       /* (PPS_CCLIN5R) RPB1  */
#define   PPS_CCLIN5R_CCLIN5_RPB5_Val         _UINT32_(0x15)                                       /* (PPS_CCLIN5R) RPB5  */
#define   PPS_CCLIN5R_CCLIN5_RPB9_Val         _UINT32_(0x16)                                       /* (PPS_CCLIN5R) RPB9  */
#define   PPS_CCLIN5R_CCLIN5_RPA1_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN5R) RPA1  */
#define   PPS_CCLIN5R_CCLIN5_RPA12_Val        _UINT32_(0x18)                                       /* (PPS_CCLIN5R) RPA12  */
#define PPS_CCLIN5R_CCLIN5_OFF                (PPS_CCLIN5R_CCLIN5_OFF_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) OFF Position  */
#define PPS_CCLIN5R_CCLIN5_RPA2               (PPS_CCLIN5R_CCLIN5_RPA2_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA2 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA8               (PPS_CCLIN5R_CCLIN5_RPA8_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA8 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA13              (PPS_CCLIN5R_CCLIN5_RPA13_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA13 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB2               (PPS_CCLIN5R_CCLIN5_RPB2_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB2 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB8               (PPS_CCLIN5R_CCLIN5_RPB8_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB8 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB13              (PPS_CCLIN5R_CCLIN5_RPB13_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB13 Position  */
#define PPS_CCLIN5R_CCLIN5_RPC8               (PPS_CCLIN5R_CCLIN5_RPC8_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPC8 Position  */
#define PPS_CCLIN5R_CCLIN5_RPD2               (PPS_CCLIN5R_CCLIN5_RPD2_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPD2 Position  */
#define PPS_CCLIN5R_CCLIN5_RPE2               (PPS_CCLIN5R_CCLIN5_RPE2_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPE2 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA4               (PPS_CCLIN5R_CCLIN5_RPA4_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA4 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB3               (PPS_CCLIN5R_CCLIN5_RPB3_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB3 Position  */
#define PPS_CCLIN5R_CCLIN5_RPC1               (PPS_CCLIN5R_CCLIN5_RPC1_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPC1 Position  */
#define PPS_CCLIN5R_CCLIN5_RPD6               (PPS_CCLIN5R_CCLIN5_RPD6_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPD6 Position  */
#define PPS_CCLIN5R_CCLIN5_RPE0               (PPS_CCLIN5R_CCLIN5_RPE0_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPE0 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA5               (PPS_CCLIN5R_CCLIN5_RPA5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA9               (PPS_CCLIN5R_CCLIN5_RPA9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA9 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB6               (PPS_CCLIN5R_CCLIN5_RPB6_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB6 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB10              (PPS_CCLIN5R_CCLIN5_RPB10_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB10 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA0               (PPS_CCLIN5R_CCLIN5_RPA0_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA0 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB1               (PPS_CCLIN5R_CCLIN5_RPB1_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB1 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB5               (PPS_CCLIN5R_CCLIN5_RPB5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB9               (PPS_CCLIN5R_CCLIN5_RPB9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB9 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA1               (PPS_CCLIN5R_CCLIN5_RPA1_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA1 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA12              (PPS_CCLIN5R_CCLIN5_RPA12_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA12 Position  */
#define PPS_CCLIN5R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN5R) Register Mask  */


