Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_TC0WO1G4R_TC0WO1G4_Pos            _UINT32_(0)                                          /* (PPS_TC0WO1G4R) TC0/WO1G4 Position */
#define PPS_TC0WO1G4R_TC0WO1G4_Msk            (_UINT32_(0x1F) << PPS_TC0WO1G4R_TC0WO1G4_Pos)       /* (PPS_TC0WO1G4R) TC0/WO1G4 Mask */
#define PPS_TC0WO1G4R_TC0WO1G4(value)         (PPS_TC0WO1G4R_TC0WO1G4_Msk & (_UINT32_(value) << PPS_TC0WO1G4R_TC0WO1G4_Pos)) /* Assigment of value for TC0WO1G4 in the PPS_TC0WO1G4R register */
#define   PPS_TC0WO1G4R_TC0WO1G4_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC0WO1G4R) OFF  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA3_Val     _UINT32_(0x1)                                        /* (PPS_TC0WO1G4R) RPA3  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA9_Val     _UINT32_(0x2)                                        /* (PPS_TC0WO1G4R) RPA9  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA14_Val    _UINT32_(0x3)                                        /* (PPS_TC0WO1G4R) RPA14  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB3_Val     _UINT32_(0x4)                                        /* (PPS_TC0WO1G4R) RPB3  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPC9_Val     _UINT32_(0x5)                                        /* (PPS_TC0WO1G4R) RPC9  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPD3_Val     _UINT32_(0x6)                                        /* (PPS_TC0WO1G4R) RPD3  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPE3_Val     _UINT32_(0x7)                                        /* (PPS_TC0WO1G4R) RPE3  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA0_Val     _UINT32_(0x8)                                        /* (PPS_TC0WO1G4R) RPA0  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB4_Val     _UINT32_(0x9)                                        /* (PPS_TC0WO1G4R) RPB4  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPC7_Val     _UINT32_(0xA)                                        /* (PPS_TC0WO1G4R) RPC7  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPD7_Val     _UINT32_(0xB)                                        /* (PPS_TC0WO1G4R) RPD7  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPE1_Val     _UINT32_(0xC)                                        /* (PPS_TC0WO1G4R) RPE1  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA6_Val     _UINT32_(0xD)                                        /* (PPS_TC0WO1G4R) RPA6  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA10_Val    _UINT32_(0xE)                                        /* (PPS_TC0WO1G4R) RPA10  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB7_Val     _UINT32_(0xF)                                        /* (PPS_TC0WO1G4R) RPB7  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB11_Val    _UINT32_(0x10)                                       /* (PPS_TC0WO1G4R) RPB11  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA1_Val     _UINT32_(0x11)                                       /* (PPS_TC0WO1G4R) RPA1  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA5_Val     _UINT32_(0x12)                                       /* (PPS_TC0WO1G4R) RPA5  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA13_Val    _UINT32_(0x13)                                       /* (PPS_TC0WO1G4R) RPA13  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB2_Val     _UINT32_(0x14)                                       /* (PPS_TC0WO1G4R) RPB2  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB6_Val     _UINT32_(0x15)                                       /* (PPS_TC0WO1G4R) RPB6  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPB10_Val    _UINT32_(0x16)                                       /* (PPS_TC0WO1G4R) RPB10  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA8_Val     _UINT32_(0x17)                                       /* (PPS_TC0WO1G4R) RPA8  */
#define   PPS_TC0WO1G4R_TC0WO1G4_RPA2_Val     _UINT32_(0x18)                                       /* (PPS_TC0WO1G4R) RPA2  */
#define PPS_TC0WO1G4R_TC0WO1G4_OFF            (PPS_TC0WO1G4R_TC0WO1G4_OFF_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) OFF Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA3           (PPS_TC0WO1G4R_TC0WO1G4_RPA3_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA3 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA9           (PPS_TC0WO1G4R_TC0WO1G4_RPA9_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA9 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA14          (PPS_TC0WO1G4R_TC0WO1G4_RPA14_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA14 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB3           (PPS_TC0WO1G4R_TC0WO1G4_RPB3_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB3 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPC9           (PPS_TC0WO1G4R_TC0WO1G4_RPC9_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPC9 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPD3           (PPS_TC0WO1G4R_TC0WO1G4_RPD3_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPD3 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPE3           (PPS_TC0WO1G4R_TC0WO1G4_RPE3_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPE3 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA0           (PPS_TC0WO1G4R_TC0WO1G4_RPA0_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA0 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB4           (PPS_TC0WO1G4R_TC0WO1G4_RPB4_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB4 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPC7           (PPS_TC0WO1G4R_TC0WO1G4_RPC7_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPC7 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPD7           (PPS_TC0WO1G4R_TC0WO1G4_RPD7_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPD7 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPE1           (PPS_TC0WO1G4R_TC0WO1G4_RPE1_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPE1 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA6           (PPS_TC0WO1G4R_TC0WO1G4_RPA6_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA6 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA10          (PPS_TC0WO1G4R_TC0WO1G4_RPA10_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA10 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB7           (PPS_TC0WO1G4R_TC0WO1G4_RPB7_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB7 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB11          (PPS_TC0WO1G4R_TC0WO1G4_RPB11_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB11 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA1           (PPS_TC0WO1G4R_TC0WO1G4_RPA1_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA1 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA5           (PPS_TC0WO1G4R_TC0WO1G4_RPA5_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA5 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA13          (PPS_TC0WO1G4R_TC0WO1G4_RPA13_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA13 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB2           (PPS_TC0WO1G4R_TC0WO1G4_RPB2_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB2 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB6           (PPS_TC0WO1G4R_TC0WO1G4_RPB6_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB6 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPB10          (PPS_TC0WO1G4R_TC0WO1G4_RPB10_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPB10 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA8           (PPS_TC0WO1G4R_TC0WO1G4_RPA8_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA8 Position  */
#define PPS_TC0WO1G4R_TC0WO1G4_RPA2           (PPS_TC0WO1G4R_TC0WO1G4_RPA2_Val << PPS_TC0WO1G4R_TC0WO1G4_Pos) /* (PPS_TC0WO1G4R) RPA2 Position  */
#define PPS_TC0WO1G4R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC0WO1G4R) Register Mask  */


/* -------- PPS_TC1WO0G1R : (PPS Offset: 0xDC) (R/W 32)  -------- */
#define PPS_TC1WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC1WO0G1R)   Reset Value */

#define PPS_TC1WO0G1R_TC1WO0G1_Pos            _UINT32_(0)                                          /* (PPS_TC1WO0G1R) TC1/WO0G1 Position */
#define PPS_TC1WO0G1R_TC1WO0G1_Msk            (_UINT32_(0x1F) << PPS_TC1WO0G1R_TC1WO0G1_Pos)       /* (PPS_TC1WO0G1R) TC1/WO0G1 Mask */
#define PPS_TC1WO0G1R_TC1WO0G1(value)         (PPS_TC1WO0G1R_TC1WO0G1_Msk & (_UINT32_(value) << PPS_TC1WO0G1R_TC1WO0G1_Pos)) /* Assigment of value for TC1WO0G1 in the PPS_TC1WO0G1R register */
#define   PPS_TC1WO0G1R_TC1WO0G1_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC1WO0G1R) OFF  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA0_Val     _UINT32_(0x1)                                        /* (PPS_TC1WO0G1R) RPA0  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA6_Val     _UINT32_(0x2)                                        /* (PPS_TC1WO0G1R) RPA6  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA11_Val    _UINT32_(0x3)                                        /* (PPS_TC1WO0G1R) RPA11  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB0_Val     _UINT32_(0x4)                                        /* (PPS_TC1WO0G1R) RPB0  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB6_Val     _UINT32_(0x5)                                        /* (PPS_TC1WO0G1R) RPB6  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB11_Val    _UINT32_(0x6)                                        /* (PPS_TC1WO0G1R) RPB11  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPC0_Val     _UINT32_(0x7)                                        /* (PPS_TC1WO0G1R) RPC0  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPD6_Val     _UINT32_(0x8)                                        /* (PPS_TC1WO0G1R) RPD6  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPE0_Val     _UINT32_(0x9)                                        /* (PPS_TC1WO0G1R) RPE0  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPE6_Val     _UINT32_(0xA)                                        /* (PPS_TC1WO0G1R) RPE6  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB1_Val     _UINT32_(0xB)                                        /* (PPS_TC1WO0G1R) RPB1  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPC9_Val     _UINT32_(0xC)                                        /* (PPS_TC1WO0G1R) RPC9  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPD3_Val     _UINT32_(0xD)                                        /* (PPS_TC1WO0G1R) RPD3  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPE4_Val     _UINT32_(0xE)                                        /* (PPS_TC1WO0G1R) RPE4  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA3_Val     _UINT32_(0xF)                                        /* (PPS_TC1WO0G1R) RPA3  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA7_Val     _UINT32_(0x10)                                       /* (PPS_TC1WO0G1R) RPA7  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB4_Val     _UINT32_(0x11)                                       /* (PPS_TC1WO0G1R) RPB4  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB8_Val     _UINT32_(0x12)                                       /* (PPS_TC1WO0G1R) RPB8  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB12_Val    _UINT32_(0x13)                                       /* (PPS_TC1WO0G1R) RPB12  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA2_Val     _UINT32_(0x14)                                       /* (PPS_TC1WO0G1R) RPA2  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA10_Val    _UINT32_(0x15)                                       /* (PPS_TC1WO0G1R) RPA10  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA14_Val    _UINT32_(0x16)                                       /* (PPS_TC1WO0G1R) RPA14  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB3_Val     _UINT32_(0x17)                                       /* (PPS_TC1WO0G1R) RPB3  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPB7_Val     _UINT32_(0x18)                                       /* (PPS_TC1WO0G1R) RPB7  */
#define   PPS_TC1WO0G1R_TC1WO0G1_RPA9_Val     _UINT32_(0x19)                                       /* (PPS_TC1WO0G1R) RPA9  */
#define PPS_TC1WO0G1R_TC1WO0G1_OFF            (PPS_TC1WO0G1R_TC1WO0G1_OFF_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) OFF Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA0           (PPS_TC1WO0G1R_TC1WO0G1_RPA0_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA0 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA6           (PPS_TC1WO0G1R_TC1WO0G1_RPA6_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA6 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA11          (PPS_TC1WO0G1R_TC1WO0G1_RPA11_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA11 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB0           (PPS_TC1WO0G1R_TC1WO0G1_RPB0_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB0 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB6           (PPS_TC1WO0G1R_TC1WO0G1_RPB6_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB6 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB11          (PPS_TC1WO0G1R_TC1WO0G1_RPB11_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB11 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPC0           (PPS_TC1WO0G1R_TC1WO0G1_RPC0_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPC0 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPD6           (PPS_TC1WO0G1R_TC1WO0G1_RPD6_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPD6 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPE0           (PPS_TC1WO0G1R_TC1WO0G1_RPE0_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPE0 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPE6           (PPS_TC1WO0G1R_TC1WO0G1_RPE6_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPE6 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB1           (PPS_TC1WO0G1R_TC1WO0G1_RPB1_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB1 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPC9           (PPS_TC1WO0G1R_TC1WO0G1_RPC9_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPC9 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPD3           (PPS_TC1WO0G1R_TC1WO0G1_RPD3_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPD3 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPE4           (PPS_TC1WO0G1R_TC1WO0G1_RPE4_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPE4 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA3           (PPS_TC1WO0G1R_TC1WO0G1_RPA3_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA3 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA7           (PPS_TC1WO0G1R_TC1WO0G1_RPA7_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA7 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB4           (PPS_TC1WO0G1R_TC1WO0G1_RPB4_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB4 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB8           (PPS_TC1WO0G1R_TC1WO0G1_RPB8_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB8 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB12          (PPS_TC1WO0G1R_TC1WO0G1_RPB12_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB12 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA2           (PPS_TC1WO0G1R_TC1WO0G1_RPA2_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA2 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA10          (PPS_TC1WO0G1R_TC1WO0G1_RPA10_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA10 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA14          (PPS_TC1WO0G1R_TC1WO0G1_RPA14_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA14 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB3           (PPS_TC1WO0G1R_TC1WO0G1_RPB3_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB3 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPB7           (PPS_TC1WO0G1R_TC1WO0G1_RPB7_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPB7 Position  */
#define PPS_TC1WO0G1R_TC1WO0G1_RPA9           (PPS_TC1WO0G1R_TC1WO0G1_RPA9_Val << PPS_TC1WO0G1R_TC1WO0G1_Pos) /* (PPS_TC1WO0G1R) RPA9 Position  */
#define PPS_TC1WO0G1R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC1WO0G1R) Register Mask  */


/* -------- PPS_TC1WO1G2R : (PPS Offset: 0xE4) (R/W 32)  -------- */
#define PPS_TC1WO1G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC1WO1G2R)   Reset Value */

#define PPS_TC1WO1G2R_TC1WO1G2_Pos            _UINT32_(0)                                          /* (PPS_TC1WO1G2R) TC1/WO1G2 Position */
#define PPS_TC1WO1G2R_TC1WO1G2_Msk            (_UINT32_(0x1F) << PPS_TC1WO1G2R_TC1WO1G2_Pos)       /* (PPS_TC1WO1G2R) TC1/WO1G2 Mask */
#define PPS_TC1WO1G2R_TC1WO1G2(value)         (PPS_TC1WO1G2R_TC1WO1G2_Msk & (_UINT32_(value) << PPS_TC1WO1G2R_TC1WO1G2_Pos)) /* Assigment of value for TC1WO1G2 in the PPS_TC1WO1G2R register */
#define   PPS_TC1WO1G2R_TC1WO1G2_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC1WO1G2R) OFF  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA1_Val     _UINT32_(0x1)                                        /* (PPS_TC1WO1G2R) RPA1  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA7_Val     _UINT32_(0x2)                                        /* (PPS_TC1WO1G2R) RPA7  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA12_Val    _UINT32_(0x3)                                        /* (PPS_TC1WO1G2R) RPA12  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB1_Val     _UINT32_(0x4)                                        /* (PPS_TC1WO1G2R) RPB1  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB7_Val     _UINT32_(0x5)                                        /* (PPS_TC1WO1G2R) RPB7  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPC1_Val     _UINT32_(0x6)                                        /* (PPS_TC1WO1G2R) RPC1  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPC7_Val     _UINT32_(0x7)                                        /* (PPS_TC1WO1G2R) RPC7  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPD7_Val     _UINT32_(0x8)                                        /* (PPS_TC1WO1G2R) RPD7  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPE1_Val     _UINT32_(0x9)                                        /* (PPS_TC1WO1G2R) RPE1  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA3_Val     _UINT32_(0xA)                                        /* (PPS_TC1WO1G2R) RPA3  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB2_Val     _UINT32_(0xB)                                        /* (PPS_TC1WO1G2R) RPB2  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPC0_Val     _UINT32_(0xC)                                        /* (PPS_TC1WO1G2R) RPC0  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPD4_Val     _UINT32_(0xD)                                        /* (PPS_TC1WO1G2R) RPD4  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPE6_Val     _UINT32_(0xE)                                        /* (PPS_TC1WO1G2R) RPE6  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA4_Val     _UINT32_(0xF)                                        /* (PPS_TC1WO1G2R) RPA4  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA8_Val     _UINT32_(0x10)                                       /* (PPS_TC1WO1G2R) RPA8  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB12_Val    _UINT32_(0x11)                                       /* (PPS_TC1WO1G2R) RPB12  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB5_Val     _UINT32_(0x12)                                       /* (PPS_TC1WO1G2R) RPB5  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB9_Val     _UINT32_(0x13)                                       /* (PPS_TC1WO1G2R) RPB9  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB13_Val    _UINT32_(0x14)                                       /* (PPS_TC1WO1G2R) RPB13  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB0_Val     _UINT32_(0x15)                                       /* (PPS_TC1WO1G2R) RPB0  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB4_Val     _UINT32_(0x16)                                       /* (PPS_TC1WO1G2R) RPB4  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPB8_Val     _UINT32_(0x17)                                       /* (PPS_TC1WO1G2R) RPB8  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA0_Val     _UINT32_(0x18)                                       /* (PPS_TC1WO1G2R) RPA0  */
#define   PPS_TC1WO1G2R_TC1WO1G2_RPA11_Val    _UINT32_(0x19)                                       /* (PPS_TC1WO1G2R) RPA11  */
#define PPS_TC1WO1G2R_TC1WO1G2_OFF            (PPS_TC1WO1G2R_TC1WO1G2_OFF_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) OFF Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA1           (PPS_TC1WO1G2R_TC1WO1G2_RPA1_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA1 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA7           (PPS_TC1WO1G2R_TC1WO1G2_RPA7_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA7 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA12          (PPS_TC1WO1G2R_TC1WO1G2_RPA12_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA12 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB1           (PPS_TC1WO1G2R_TC1WO1G2_RPB1_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB1 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB7           (PPS_TC1WO1G2R_TC1WO1G2_RPB7_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB7 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPC1           (PPS_TC1WO1G2R_TC1WO1G2_RPC1_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPC1 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPC7           (PPS_TC1WO1G2R_TC1WO1G2_RPC7_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPC7 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPD7           (PPS_TC1WO1G2R_TC1WO1G2_RPD7_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPD7 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPE1           (PPS_TC1WO1G2R_TC1WO1G2_RPE1_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPE1 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA3           (PPS_TC1WO1G2R_TC1WO1G2_RPA3_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA3 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB2           (PPS_TC1WO1G2R_TC1WO1G2_RPB2_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB2 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPC0           (PPS_TC1WO1G2R_TC1WO1G2_RPC0_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPC0 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPD4           (PPS_TC1WO1G2R_TC1WO1G2_RPD4_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPD4 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPE6           (PPS_TC1WO1G2R_TC1WO1G2_RPE6_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPE6 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA4           (PPS_TC1WO1G2R_TC1WO1G2_RPA4_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA4 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA8           (PPS_TC1WO1G2R_TC1WO1G2_RPA8_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA8 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB12          (PPS_TC1WO1G2R_TC1WO1G2_RPB12_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB12 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB5           (PPS_TC1WO1G2R_TC1WO1G2_RPB5_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB5 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB9           (PPS_TC1WO1G2R_TC1WO1G2_RPB9_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB9 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB13          (PPS_TC1WO1G2R_TC1WO1G2_RPB13_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB13 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB0           (PPS_TC1WO1G2R_TC1WO1G2_RPB0_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB0 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB4           (PPS_TC1WO1G2R_TC1WO1G2_RPB4_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB4 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPB8           (PPS_TC1WO1G2R_TC1WO1G2_RPB8_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPB8 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA0           (PPS_TC1WO1G2R_TC1WO1G2_RPA0_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA0 Position  */
#define PPS_TC1WO1G2R_TC1WO1G2_RPA11          (PPS_TC1WO1G2R_TC1WO1G2_RPA11_Val << PPS_TC1WO1G2R_TC1WO1G2_Pos) /* (PPS_TC1WO1G2R) RPA11 Position  */
#define PPS_TC1WO1G2R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC1WO1G2R) Register Mask  */


/* -------- PPS_TC2WO0G1R : (PPS Offset: 0xEC) (R/W 32)  -------- */
#define PPS_TC2WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC2WO0G1R)   Reset Value */

