Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_QEIQEA0G4R_QEIQEA0G4_Pos          _UINT32_(0)                                          /* (PPS_QEIQEA0G4R) QEI/QEA0G4 Position */
#define PPS_QEIQEA0G4R_QEIQEA0G4_Msk          (_UINT32_(0x1F) << PPS_QEIQEA0G4R_QEIQEA0G4_Pos)     /* (PPS_QEIQEA0G4R) QEI/QEA0G4 Mask */
#define PPS_QEIQEA0G4R_QEIQEA0G4(value)       (PPS_QEIQEA0G4R_QEIQEA0G4_Msk & (_UINT32_(value) << PPS_QEIQEA0G4R_QEIQEA0G4_Pos)) /* Assigment of value for QEIQEA0G4 in the PPS_QEIQEA0G4R register */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_OFF_Val    _UINT32_(0x0)                                        /* (PPS_QEIQEA0G4R) OFF  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA3_Val   _UINT32_(0x1)                                        /* (PPS_QEIQEA0G4R) RPA3  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA9_Val   _UINT32_(0x2)                                        /* (PPS_QEIQEA0G4R) RPA9  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA14_Val  _UINT32_(0x3)                                        /* (PPS_QEIQEA0G4R) RPA14  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB3_Val   _UINT32_(0x4)                                        /* (PPS_QEIQEA0G4R) RPB3  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPC9_Val   _UINT32_(0x5)                                        /* (PPS_QEIQEA0G4R) RPC9  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPD3_Val   _UINT32_(0x6)                                        /* (PPS_QEIQEA0G4R) RPD3  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPE3_Val   _UINT32_(0x7)                                        /* (PPS_QEIQEA0G4R) RPE3  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA0_Val   _UINT32_(0x8)                                        /* (PPS_QEIQEA0G4R) RPA0  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB4_Val   _UINT32_(0x9)                                        /* (PPS_QEIQEA0G4R) RPB4  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPC7_Val   _UINT32_(0xA)                                        /* (PPS_QEIQEA0G4R) RPC7  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPD7_Val   _UINT32_(0xB)                                        /* (PPS_QEIQEA0G4R) RPD7  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPE1_Val   _UINT32_(0xC)                                        /* (PPS_QEIQEA0G4R) RPE1  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA6_Val   _UINT32_(0xD)                                        /* (PPS_QEIQEA0G4R) RPA6  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA10_Val  _UINT32_(0xE)                                        /* (PPS_QEIQEA0G4R) RPA10  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB7_Val   _UINT32_(0xF)                                        /* (PPS_QEIQEA0G4R) RPB7  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB11_Val  _UINT32_(0x10)                                       /* (PPS_QEIQEA0G4R) RPB11  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA1_Val   _UINT32_(0x11)                                       /* (PPS_QEIQEA0G4R) RPA1  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA5_Val   _UINT32_(0x12)                                       /* (PPS_QEIQEA0G4R) RPA5  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA13_Val  _UINT32_(0x13)                                       /* (PPS_QEIQEA0G4R) RPA13  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB2_Val   _UINT32_(0x14)                                       /* (PPS_QEIQEA0G4R) RPB2  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB6_Val   _UINT32_(0x15)                                       /* (PPS_QEIQEA0G4R) RPB6  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPB10_Val  _UINT32_(0x16)                                       /* (PPS_QEIQEA0G4R) RPB10  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA8_Val   _UINT32_(0x17)                                       /* (PPS_QEIQEA0G4R) RPA8  */
#define   PPS_QEIQEA0G4R_QEIQEA0G4_RPA2_Val   _UINT32_(0x18)                                       /* (PPS_QEIQEA0G4R) RPA2  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_OFF          (PPS_QEIQEA0G4R_QEIQEA0G4_OFF_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) OFF Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA3         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA3_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA3 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA9         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA9_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA9 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA14        (PPS_QEIQEA0G4R_QEIQEA0G4_RPA14_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA14 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB3         (PPS_QEIQEA0G4R_QEIQEA0G4_RPB3_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB3 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPC9         (PPS_QEIQEA0G4R_QEIQEA0G4_RPC9_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPC9 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPD3         (PPS_QEIQEA0G4R_QEIQEA0G4_RPD3_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPD3 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPE3         (PPS_QEIQEA0G4R_QEIQEA0G4_RPE3_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPE3 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA0         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA0_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA0 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB4         (PPS_QEIQEA0G4R_QEIQEA0G4_RPB4_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB4 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPC7         (PPS_QEIQEA0G4R_QEIQEA0G4_RPC7_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPC7 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPD7         (PPS_QEIQEA0G4R_QEIQEA0G4_RPD7_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPD7 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPE1         (PPS_QEIQEA0G4R_QEIQEA0G4_RPE1_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPE1 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA6         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA6_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA6 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA10        (PPS_QEIQEA0G4R_QEIQEA0G4_RPA10_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA10 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB7         (PPS_QEIQEA0G4R_QEIQEA0G4_RPB7_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB7 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB11        (PPS_QEIQEA0G4R_QEIQEA0G4_RPB11_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB11 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA1         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA1_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA1 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA5         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA5_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA5 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA13        (PPS_QEIQEA0G4R_QEIQEA0G4_RPA13_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA13 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB2         (PPS_QEIQEA0G4R_QEIQEA0G4_RPB2_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB2 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB6         (PPS_QEIQEA0G4R_QEIQEA0G4_RPB6_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB6 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPB10        (PPS_QEIQEA0G4R_QEIQEA0G4_RPB10_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPB10 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA8         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA8_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA8 Position  */
#define PPS_QEIQEA0G4R_QEIQEA0G4_RPA2         (PPS_QEIQEA0G4R_QEIQEA0G4_RPA2_Val << PPS_QEIQEA0G4R_QEIQEA0G4_Pos) /* (PPS_QEIQEA0G4R) RPA2 Position  */
#define PPS_QEIQEA0G4R_Msk                    _UINT32_(0x0000001F)                                 /* (PPS_QEIQEA0G4R) Register Mask  */


/* -------- PPS_QEIQEB0G4R : (PPS Offset: 0x184) (R/W 32)  -------- */
#define PPS_QEIQEB0G4R_RESETVALUE             _UINT32_(0x00)                                       /*  (PPS_QEIQEB0G4R)   Reset Value */

#define PPS_QEIQEB0G4R_QEIQEB0G4_Pos          _UINT32_(0)                                          /* (PPS_QEIQEB0G4R) QEI/QEB0G4 Position */
#define PPS_QEIQEB0G4R_QEIQEB0G4_Msk          (_UINT32_(0x1F) << PPS_QEIQEB0G4R_QEIQEB0G4_Pos)     /* (PPS_QEIQEB0G4R) QEI/QEB0G4 Mask */
#define PPS_QEIQEB0G4R_QEIQEB0G4(value)       (PPS_QEIQEB0G4R_QEIQEB0G4_Msk & (_UINT32_(value) << PPS_QEIQEB0G4R_QEIQEB0G4_Pos)) /* Assigment of value for QEIQEB0G4 in the PPS_QEIQEB0G4R register */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_OFF_Val    _UINT32_(0x0)                                        /* (PPS_QEIQEB0G4R) OFF  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA3_Val   _UINT32_(0x1)                                        /* (PPS_QEIQEB0G4R) RPA3  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA9_Val   _UINT32_(0x2)                                        /* (PPS_QEIQEB0G4R) RPA9  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA14_Val  _UINT32_(0x3)                                        /* (PPS_QEIQEB0G4R) RPA14  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB3_Val   _UINT32_(0x4)                                        /* (PPS_QEIQEB0G4R) RPB3  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPC9_Val   _UINT32_(0x5)                                        /* (PPS_QEIQEB0G4R) RPC9  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPD3_Val   _UINT32_(0x6)                                        /* (PPS_QEIQEB0G4R) RPD3  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPE3_Val   _UINT32_(0x7)                                        /* (PPS_QEIQEB0G4R) RPE3  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA0_Val   _UINT32_(0x8)                                        /* (PPS_QEIQEB0G4R) RPA0  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB4_Val   _UINT32_(0x9)                                        /* (PPS_QEIQEB0G4R) RPB4  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPC7_Val   _UINT32_(0xA)                                        /* (PPS_QEIQEB0G4R) RPC7  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPD7_Val   _UINT32_(0xB)                                        /* (PPS_QEIQEB0G4R) RPD7  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPE1_Val   _UINT32_(0xC)                                        /* (PPS_QEIQEB0G4R) RPE1  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA6_Val   _UINT32_(0xD)                                        /* (PPS_QEIQEB0G4R) RPA6  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA10_Val  _UINT32_(0xE)                                        /* (PPS_QEIQEB0G4R) RPA10  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB7_Val   _UINT32_(0xF)                                        /* (PPS_QEIQEB0G4R) RPB7  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB11_Val  _UINT32_(0x10)                                       /* (PPS_QEIQEB0G4R) RPB11  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA1_Val   _UINT32_(0x11)                                       /* (PPS_QEIQEB0G4R) RPA1  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA5_Val   _UINT32_(0x12)                                       /* (PPS_QEIQEB0G4R) RPA5  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA13_Val  _UINT32_(0x13)                                       /* (PPS_QEIQEB0G4R) RPA13  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB2_Val   _UINT32_(0x14)                                       /* (PPS_QEIQEB0G4R) RPB2  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB6_Val   _UINT32_(0x15)                                       /* (PPS_QEIQEB0G4R) RPB6  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPB10_Val  _UINT32_(0x16)                                       /* (PPS_QEIQEB0G4R) RPB10  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA8_Val   _UINT32_(0x17)                                       /* (PPS_QEIQEB0G4R) RPA8  */
#define   PPS_QEIQEB0G4R_QEIQEB0G4_RPA2_Val   _UINT32_(0x18)                                       /* (PPS_QEIQEB0G4R) RPA2  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_OFF          (PPS_QEIQEB0G4R_QEIQEB0G4_OFF_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) OFF Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA3         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA3_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA3 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA9         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA9_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA9 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA14        (PPS_QEIQEB0G4R_QEIQEB0G4_RPA14_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA14 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB3         (PPS_QEIQEB0G4R_QEIQEB0G4_RPB3_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB3 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPC9         (PPS_QEIQEB0G4R_QEIQEB0G4_RPC9_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPC9 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPD3         (PPS_QEIQEB0G4R_QEIQEB0G4_RPD3_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPD3 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPE3         (PPS_QEIQEB0G4R_QEIQEB0G4_RPE3_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPE3 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA0         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA0_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA0 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB4         (PPS_QEIQEB0G4R_QEIQEB0G4_RPB4_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB4 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPC7         (PPS_QEIQEB0G4R_QEIQEB0G4_RPC7_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPC7 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPD7         (PPS_QEIQEB0G4R_QEIQEB0G4_RPD7_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPD7 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPE1         (PPS_QEIQEB0G4R_QEIQEB0G4_RPE1_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPE1 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA6         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA6_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA6 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA10        (PPS_QEIQEB0G4R_QEIQEB0G4_RPA10_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA10 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB7         (PPS_QEIQEB0G4R_QEIQEB0G4_RPB7_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB7 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB11        (PPS_QEIQEB0G4R_QEIQEB0G4_RPB11_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB11 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA1         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA1_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA1 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA5         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA5_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA5 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA13        (PPS_QEIQEB0G4R_QEIQEB0G4_RPA13_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA13 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB2         (PPS_QEIQEB0G4R_QEIQEB0G4_RPB2_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB2 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB6         (PPS_QEIQEB0G4R_QEIQEB0G4_RPB6_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB6 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPB10        (PPS_QEIQEB0G4R_QEIQEB0G4_RPB10_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPB10 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA8         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA8_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA8 Position  */
#define PPS_QEIQEB0G4R_QEIQEB0G4_RPA2         (PPS_QEIQEB0G4R_QEIQEB0G4_RPA2_Val << PPS_QEIQEB0G4R_QEIQEB0G4_Pos) /* (PPS_QEIQEB0G4R) RPA2 Position  */
#define PPS_QEIQEB0G4R_Msk                    _UINT32_(0x0000001F)                                 /* (PPS_QEIQEB0G4R) Register Mask  */


/* -------- PPS_QEIQEB0G5R : (PPS Offset: 0x188) (R/W 32)  -------- */
#define PPS_QEIQEB0G5R_RESETVALUE             _UINT32_(0x00)                                       /*  (PPS_QEIQEB0G5R)   Reset Value */

#define PPS_QEIQEB0G5R_QEIQEB0G5_Pos          _UINT32_(0)                                          /* (PPS_QEIQEB0G5R) QEI/QEB0G5 Position */
#define PPS_QEIQEB0G5R_QEIQEB0G5_Msk          (_UINT32_(0x1F) << PPS_QEIQEB0G5R_QEIQEB0G5_Pos)     /* (PPS_QEIQEB0G5R) QEI/QEB0G5 Mask */
#define PPS_QEIQEB0G5R_QEIQEB0G5(value)       (PPS_QEIQEB0G5R_QEIQEB0G5_Msk & (_UINT32_(value) << PPS_QEIQEB0G5R_QEIQEB0G5_Pos)) /* Assigment of value for QEIQEB0G5 in the PPS_QEIQEB0G5R register */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_OFF_Val    _UINT32_(0x0)                                        /* (PPS_QEIQEB0G5R) OFF  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPA4_Val   _UINT32_(0x1)                                        /* (PPS_QEIQEB0G5R) RPA4  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPA10_Val  _UINT32_(0x2)                                        /* (PPS_QEIQEB0G5R) RPA10  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPB4_Val   _UINT32_(0x3)                                        /* (PPS_QEIQEB0G5R) RPB4  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPB10_Val  _UINT32_(0x4)                                        /* (PPS_QEIQEB0G5R) RPB10  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPD4_Val   _UINT32_(0x5)                                        /* (PPS_QEIQEB0G5R) RPD4  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPE4_Val   _UINT32_(0x6)                                        /* (PPS_QEIQEB0G5R) RPE4  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPA1_Val   _UINT32_(0x7)                                        /* (PPS_QEIQEB0G5R) RPA1  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPB0_Val   _UINT32_(0x8)                                        /* (PPS_QEIQEB0G5R) RPB0  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPC8_Val   _UINT32_(0x9)                                        /* (PPS_QEIQEB0G5R) RPC8  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPD2_Val   _UINT32_(0xA)                                        /* (PPS_QEIQEB0G5R) RPD2  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPE2_Val   _UINT32_(0xB)                                        /* (PPS_QEIQEB0G5R) RPE2  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPC10_Val  _UINT32_(0xC)                                        /* (PPS_QEIQEB0G5R) RPC10  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPC11_Val  _UINT32_(0xD)                                        /* (PPS_QEIQEB0G5R) RPC11  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPA15_Val  _UINT32_(0xE)                                        /* (PPS_QEIQEB0G5R) RPA15  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPB14_Val  _UINT32_(0xF)                                        /* (PPS_QEIQEB0G5R) RPB14  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPB15_Val  _UINT32_(0x10)                                       /* (PPS_QEIQEB0G5R) RPB15  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPD0_Val   _UINT32_(0x11)                                       /* (PPS_QEIQEB0G5R) RPD0  */
#define   PPS_QEIQEB0G5R_QEIQEB0G5_RPD1_Val   _UINT32_(0x12)                                       /* (PPS_QEIQEB0G5R) RPD1  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_OFF          (PPS_QEIQEB0G5R_QEIQEB0G5_OFF_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) OFF Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPA4         (PPS_QEIQEB0G5R_QEIQEB0G5_RPA4_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPA4 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPA10        (PPS_QEIQEB0G5R_QEIQEB0G5_RPA10_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPA10 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPB4         (PPS_QEIQEB0G5R_QEIQEB0G5_RPB4_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPB4 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPB10        (PPS_QEIQEB0G5R_QEIQEB0G5_RPB10_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPB10 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPD4         (PPS_QEIQEB0G5R_QEIQEB0G5_RPD4_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPD4 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPE4         (PPS_QEIQEB0G5R_QEIQEB0G5_RPE4_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPE4 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPA1         (PPS_QEIQEB0G5R_QEIQEB0G5_RPA1_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPA1 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPB0         (PPS_QEIQEB0G5R_QEIQEB0G5_RPB0_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPB0 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPC8         (PPS_QEIQEB0G5R_QEIQEB0G5_RPC8_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPC8 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPD2         (PPS_QEIQEB0G5R_QEIQEB0G5_RPD2_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPD2 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPE2         (PPS_QEIQEB0G5R_QEIQEB0G5_RPE2_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPE2 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPC10        (PPS_QEIQEB0G5R_QEIQEB0G5_RPC10_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPC10 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPC11        (PPS_QEIQEB0G5R_QEIQEB0G5_RPC11_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPC11 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPA15        (PPS_QEIQEB0G5R_QEIQEB0G5_RPA15_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPA15 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPB14        (PPS_QEIQEB0G5R_QEIQEB0G5_RPB14_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPB14 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPB15        (PPS_QEIQEB0G5R_QEIQEB0G5_RPB15_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPB15 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPD0         (PPS_QEIQEB0G5R_QEIQEB0G5_RPD0_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPD0 Position  */
#define PPS_QEIQEB0G5R_QEIQEB0G5_RPD1         (PPS_QEIQEB0G5R_QEIQEB0G5_RPD1_Val << PPS_QEIQEB0G5R_QEIQEB0G5_Pos) /* (PPS_QEIQEB0G5R) RPD1 Position  */
#define PPS_QEIQEB0G5R_Msk                    _UINT32_(0x0000001F)                                 /* (PPS_QEIQEB0G5R) Register Mask  */


/* -------- PPS_ACCMPTENR : (PPS Offset: 0x18C) (R/W 32)  -------- */
#define PPS_ACCMPTENR_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_ACCMPTENR)   Reset Value */

