Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#define PPS_RPB11G4R_RPB11G4R_Pos             _UINT32_(0)                                          /* (PPS_RPB11G4R) RPB11/G4 Position */
#define PPS_RPB11G4R_RPB11G4R_Msk             (_UINT32_(0x3F) << PPS_RPB11G4R_RPB11G4R_Pos)        /* (PPS_RPB11G4R) RPB11/G4 Mask */
#define PPS_RPB11G4R_RPB11G4R(value)          (PPS_RPB11G4R_RPB11G4R_Msk & (_UINT32_(value) << PPS_RPB11G4R_RPB11G4R_Pos)) /* Assigment of value for RPB11G4R in the PPS_RPB11G4R register */
#define   PPS_RPB11G4R_RPB11G4R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPB11G4R) OFF  */
#define   PPS_RPB11G4R_RPB11G4R_CCLO1_Val     _UINT32_(0x1)                                        /* (PPS_RPB11G4R) CCL/OUT1  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM0P2_Val   _UINT32_(0x2)                                        /* (PPS_RPB11G4R) SERCOM0/PAD2  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM0P0_Val   _UINT32_(0x3)                                        /* (PPS_RPB11G4R) SERCOM0/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM1P3_Val   _UINT32_(0x4)                                        /* (PPS_RPB11G4R) SERCOM1/PAD3  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM1P0_Val   _UINT32_(0x5)                                        /* (PPS_RPB11G4R) SERCOM1/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM2P2_Val   _UINT32_(0x6)                                        /* (PPS_RPB11G4R) SERCOM2/PAD2  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM2P0_Val   _UINT32_(0x7)                                        /* (PPS_RPB11G4R) SERCOM2/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM3P3_Val   _UINT32_(0x8)                                        /* (PPS_RPB11G4R) SERCOM3/PAD3  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM3P0_Val   _UINT32_(0x9)                                        /* (PPS_RPB11G4R) SERCOM3/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM4P2_Val   _UINT32_(0xA)                                        /* (PPS_RPB11G4R) SERCOM4/PAD2  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM4P0_Val   _UINT32_(0xB)                                        /* (PPS_RPB11G4R) SERCOM4/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM5P3_Val   _UINT32_(0xC)                                        /* (PPS_RPB11G4R) SERCOM5/PAD3  */
#define   PPS_RPB11G4R_RPB11G4R_SCOM5P0_Val   _UINT32_(0xD)                                        /* (PPS_RPB11G4R) SERCOM5/PAD0  */
#define   PPS_RPB11G4R_RPB11G4R_TCC0WO3_Val   _UINT32_(0xE)                                        /* (PPS_RPB11G4R) TCC0/WO3  */
#define   PPS_RPB11G4R_RPB11G4R_TCC0WO1_Val   _UINT32_(0xF)                                        /* (PPS_RPB11G4R) TCC0/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TCC0WO5_Val   _UINT32_(0x10)                                       /* (PPS_RPB11G4R) TCC0/WO5  */
#define   PPS_RPB11G4R_RPB11G4R_TCC1WO3_Val   _UINT32_(0x11)                                       /* (PPS_RPB11G4R) TCC1/WO3  */
#define   PPS_RPB11G4R_RPB11G4R_TCC1WO1_Val   _UINT32_(0x12)                                       /* (PPS_RPB11G4R) TCC1/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TCC1WO5_Val   _UINT32_(0x13)                                       /* (PPS_RPB11G4R) TCC1/WO5  */
#define   PPS_RPB11G4R_RPB11G4R_TCC2WO1_Val   _UINT32_(0x14)                                       /* (PPS_RPB11G4R) TCC2/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC0WO0_Val    _UINT32_(0x15)                                       /* (PPS_RPB11G4R) TC0/WO0  */
#define   PPS_RPB11G4R_RPB11G4R_TC1WO1_Val    _UINT32_(0x16)                                       /* (PPS_RPB11G4R) TC1/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC2WO1_Val    _UINT32_(0x17)                                       /* (PPS_RPB11G4R) TC2/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC3WO1_Val    _UINT32_(0x18)                                       /* (PPS_RPB11G4R) TC3/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC4WO1_Val    _UINT32_(0x19)                                       /* (PPS_RPB11G4R) TC4/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC5WO1_Val    _UINT32_(0x1A)                                       /* (PPS_RPB11G4R) TC5/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC6WO1_Val    _UINT32_(0x1B)                                       /* (PPS_RPB11G4R) TC6/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC7WO1_Val    _UINT32_(0x1C)                                       /* (PPS_RPB11G4R) TC7/WO1  */
#define   PPS_RPB11G4R_RPB11G4R_TC9WO0_Val    _UINT32_(0x1D)                                       /* (PPS_RPB11G4R) TC9/WO0  */
#define   PPS_RPB11G4R_RPB11G4R_QSPICS_Val    _UINT32_(0x1E)                                       /* (PPS_RPB11G4R) QSPI/CS  */
#define   PPS_RPB11G4R_RPB11G4R_QD2_Val       _UINT32_(0x1F)                                       /* (PPS_RPB11G4R) QSPI/DATA2  */
#define   PPS_RPB11G4R_RPB11G4R_QD1_Val       _UINT32_(0x20)                                       /* (PPS_RPB11G4R) QSPI/DATA1  */
#define   PPS_RPB11G4R_RPB11G4R_QD0_Val       _UINT32_(0x21)                                       /* (PPS_RPB11G4R) QSPI/DATA0  */
#define   PPS_RPB11G4R_RPB11G4R_TSTBUS2_Val   _UINT32_(0x22)                                       /* (PPS_RPB11G4R) TSTBUS2  */
#define   PPS_RPB11G4R_RPB11G4R_TSTBUS6_Val   _UINT32_(0x23)                                       /* (PPS_RPB11G4R) TSTBUS6  */
#define   PPS_RPB11G4R_RPB11G4R_AC_CMP1_Val   _UINT32_(0x24)                                       /* (PPS_RPB11G4R) AC/CMP1  */
#define   PPS_RPB11G4R_RPB11G4R_AC_CMPTOUT_Val _UINT32_(0x25)                                       /* (PPS_RPB11G4R) AC/CMPTOUT  */
#define   PPS_RPB11G4R_RPB11G4R_CAN1_TX_Val   _UINT32_(0x26)                                       /* (PPS_RPB11G4R) CAN1/TX  */
#define   PPS_RPB11G4R_RPB11G4R_FECTRL3_Val   _UINT32_(0x27)                                       /* (PPS_RPB11G4R) FECTRL3  */
#define   PPS_RPB11G4R_RPB11G4R_FECTRL5_Val   _UINT32_(0x28)                                       /* (PPS_RPB11G4R) FECTRL5  */
#define PPS_RPB11G4R_RPB11G4R_OFF             (PPS_RPB11G4R_RPB11G4R_OFF_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) OFF Position  */
#define PPS_RPB11G4R_RPB11G4R_CCLO1           (PPS_RPB11G4R_RPB11G4R_CCLO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) CCL/OUT1 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM0P2         (PPS_RPB11G4R_RPB11G4R_SCOM0P2_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM0/PAD2 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM0P0         (PPS_RPB11G4R_RPB11G4R_SCOM0P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM0/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM1P3         (PPS_RPB11G4R_RPB11G4R_SCOM1P3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM1/PAD3 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM1P0         (PPS_RPB11G4R_RPB11G4R_SCOM1P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM1/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM2P2         (PPS_RPB11G4R_RPB11G4R_SCOM2P2_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM2/PAD2 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM2P0         (PPS_RPB11G4R_RPB11G4R_SCOM2P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM2/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM3P3         (PPS_RPB11G4R_RPB11G4R_SCOM3P3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM3/PAD3 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM3P0         (PPS_RPB11G4R_RPB11G4R_SCOM3P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM3/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM4P2         (PPS_RPB11G4R_RPB11G4R_SCOM4P2_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM4/PAD2 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM4P0         (PPS_RPB11G4R_RPB11G4R_SCOM4P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM4/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM5P3         (PPS_RPB11G4R_RPB11G4R_SCOM5P3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM5/PAD3 Position  */
#define PPS_RPB11G4R_RPB11G4R_SCOM5P0         (PPS_RPB11G4R_RPB11G4R_SCOM5P0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) SERCOM5/PAD0 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC0WO3         (PPS_RPB11G4R_RPB11G4R_TCC0WO3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC0/WO3 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC0WO1         (PPS_RPB11G4R_RPB11G4R_TCC0WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC0/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC0WO5         (PPS_RPB11G4R_RPB11G4R_TCC0WO5_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC0/WO5 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC1WO3         (PPS_RPB11G4R_RPB11G4R_TCC1WO3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC1/WO3 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC1WO1         (PPS_RPB11G4R_RPB11G4R_TCC1WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC1/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC1WO5         (PPS_RPB11G4R_RPB11G4R_TCC1WO5_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC1/WO5 Position  */
#define PPS_RPB11G4R_RPB11G4R_TCC2WO1         (PPS_RPB11G4R_RPB11G4R_TCC2WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TCC2/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC0WO0          (PPS_RPB11G4R_RPB11G4R_TC0WO0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC0/WO0 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC1WO1          (PPS_RPB11G4R_RPB11G4R_TC1WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC1/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC2WO1          (PPS_RPB11G4R_RPB11G4R_TC2WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC2/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC3WO1          (PPS_RPB11G4R_RPB11G4R_TC3WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC3/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC4WO1          (PPS_RPB11G4R_RPB11G4R_TC4WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC4/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC5WO1          (PPS_RPB11G4R_RPB11G4R_TC5WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC5/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC6WO1          (PPS_RPB11G4R_RPB11G4R_TC6WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC6/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC7WO1          (PPS_RPB11G4R_RPB11G4R_TC7WO1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC7/WO1 Position  */
#define PPS_RPB11G4R_RPB11G4R_TC9WO0          (PPS_RPB11G4R_RPB11G4R_TC9WO0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TC9/WO0 Position  */
#define PPS_RPB11G4R_RPB11G4R_QSPICS          (PPS_RPB11G4R_RPB11G4R_QSPICS_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) QSPI/CS Position  */
#define PPS_RPB11G4R_RPB11G4R_QD2             (PPS_RPB11G4R_RPB11G4R_QD2_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) QSPI/DATA2 Position  */
#define PPS_RPB11G4R_RPB11G4R_QD1             (PPS_RPB11G4R_RPB11G4R_QD1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) QSPI/DATA1 Position  */
#define PPS_RPB11G4R_RPB11G4R_QD0             (PPS_RPB11G4R_RPB11G4R_QD0_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) QSPI/DATA0 Position  */
#define PPS_RPB11G4R_RPB11G4R_TSTBUS2         (PPS_RPB11G4R_RPB11G4R_TSTBUS2_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TSTBUS2 Position  */
#define PPS_RPB11G4R_RPB11G4R_TSTBUS6         (PPS_RPB11G4R_RPB11G4R_TSTBUS6_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) TSTBUS6 Position  */
#define PPS_RPB11G4R_RPB11G4R_AC_CMP1         (PPS_RPB11G4R_RPB11G4R_AC_CMP1_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) AC/CMP1 Position  */
#define PPS_RPB11G4R_RPB11G4R_AC_CMPTOUT      (PPS_RPB11G4R_RPB11G4R_AC_CMPTOUT_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) AC/CMPTOUT Position  */
#define PPS_RPB11G4R_RPB11G4R_CAN1_TX         (PPS_RPB11G4R_RPB11G4R_CAN1_TX_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) CAN1/TX Position  */
#define PPS_RPB11G4R_RPB11G4R_FECTRL3         (PPS_RPB11G4R_RPB11G4R_FECTRL3_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) FECTRL3 Position  */
#define PPS_RPB11G4R_RPB11G4R_FECTRL5         (PPS_RPB11G4R_RPB11G4R_FECTRL5_Val << PPS_RPB11G4R_RPB11G4R_Pos) /* (PPS_RPB11G4R) FECTRL5 Position  */
#define PPS_RPB11G4R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPB11G4R) Register Mask  */


