Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
/* -------- PPS_RPE1G2R : (PPS Offset: 0x414) (R/W 32)  -------- */
#define PPS_RPE1G2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPE1G2R)   Reset Value */

#define PPS_RPE1G2R_RPE1G2R_Pos               _UINT32_(0)                                          /* (PPS_RPE1G2R) RPE1/G2 Position */
#define PPS_RPE1G2R_RPE1G2R_Msk               (_UINT32_(0x3F) << PPS_RPE1G2R_RPE1G2R_Pos)          /* (PPS_RPE1G2R) RPE1/G2 Mask */
#define PPS_RPE1G2R_RPE1G2R(value)            (PPS_RPE1G2R_RPE1G2R_Msk & (_UINT32_(value) << PPS_RPE1G2R_RPE1G2R_Pos)) /* Assigment of value for RPE1G2R in the PPS_RPE1G2R register */
#define   PPS_RPE1G2R_RPE1G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPE1G2R) OFF  */
#define   PPS_RPE1G2R_RPE1G2R_CCLO1_Val       _UINT32_(0x1)                                        /* (PPS_RPE1G2R) CCL/OUT1  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM0P0_Val     _UINT32_(0x2)                                        /* (PPS_RPE1G2R) SERCOM0/PAD0  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM0P3_Val     _UINT32_(0x3)                                        /* (PPS_RPE1G2R) SERCOM0/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM0P2_Val     _UINT32_(0x4)                                        /* (PPS_RPE1G2R) SERCOM0/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPE1G2R) SERCOM1/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPE1G2R) SERCOM1/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM2P0_Val     _UINT32_(0x7)                                        /* (PPS_RPE1G2R) SERCOM2/PAD0  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM2P3_Val     _UINT32_(0x8)                                        /* (PPS_RPE1G2R) SERCOM2/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM2P2_Val     _UINT32_(0x9)                                        /* (PPS_RPE1G2R) SERCOM2/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM3P3_Val     _UINT32_(0xA)                                        /* (PPS_RPE1G2R) SERCOM3/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM3P2_Val     _UINT32_(0xB)                                        /* (PPS_RPE1G2R) SERCOM3/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM4P0_Val     _UINT32_(0xC)                                        /* (PPS_RPE1G2R) SERCOM4/PAD0  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM4P3_Val     _UINT32_(0xD)                                        /* (PPS_RPE1G2R) SERCOM4/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM4P2_Val     _UINT32_(0xE)                                        /* (PPS_RPE1G2R) SERCOM4/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM5P3_Val     _UINT32_(0xF)                                        /* (PPS_RPE1G2R) SERCOM5/PAD3  */
#define   PPS_RPE1G2R_RPE1G2R_SCOM5P2_Val     _UINT32_(0x10)                                       /* (PPS_RPE1G2R) SERCOM5/PAD2  */
#define   PPS_RPE1G2R_RPE1G2R_TCC0WO1_Val     _UINT32_(0x11)                                       /* (PPS_RPE1G2R) TCC0/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TCC0WO5_Val     _UINT32_(0x12)                                       /* (PPS_RPE1G2R) TCC0/WO5  */
#define   PPS_RPE1G2R_RPE1G2R_TCC0WO3_Val     _UINT32_(0x13)                                       /* (PPS_RPE1G2R) TCC0/WO3  */
#define   PPS_RPE1G2R_RPE1G2R_TCC1WO1_Val     _UINT32_(0x14)                                       /* (PPS_RPE1G2R) TCC1/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TCC1WO5_Val     _UINT32_(0x15)                                       /* (PPS_RPE1G2R) TCC1/WO5  */
#define   PPS_RPE1G2R_RPE1G2R_TCC1WO3_Val     _UINT32_(0x16)                                       /* (PPS_RPE1G2R) TCC1/WO3  */
#define   PPS_RPE1G2R_RPE1G2R_TCC2WO1_Val     _UINT32_(0x17)                                       /* (PPS_RPE1G2R) TCC2/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC0WO1_Val      _UINT32_(0x18)                                       /* (PPS_RPE1G2R) TC0/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC1WO1_Val      _UINT32_(0x19)                                       /* (PPS_RPE1G2R) TC1/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC2WO1_Val      _UINT32_(0x1A)                                       /* (PPS_RPE1G2R) TC2/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC3WO1_Val      _UINT32_(0x1B)                                       /* (PPS_RPE1G2R) TC3/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC4WO1_Val      _UINT32_(0x1C)                                       /* (PPS_RPE1G2R) TC4/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC5WO1_Val      _UINT32_(0x1D)                                       /* (PPS_RPE1G2R) TC5/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC6WO1_Val      _UINT32_(0x1E)                                       /* (PPS_RPE1G2R) TC6/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC7WO1_Val      _UINT32_(0x1F)                                       /* (PPS_RPE1G2R) TC7/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC8WO1_Val      _UINT32_(0x20)                                       /* (PPS_RPE1G2R) TC8/WO1  */
#define   PPS_RPE1G2R_RPE1G2R_TC9WO0_Val      _UINT32_(0x21)                                       /* (PPS_RPE1G2R) TC9/WO0  */
#define   PPS_RPE1G2R_RPE1G2R_QSPICS_Val      _UINT32_(0x22)                                       /* (PPS_RPE1G2R) QSPI/CS  */
#define   PPS_RPE1G2R_RPE1G2R_QD0_Val         _UINT32_(0x23)                                       /* (PPS_RPE1G2R) QSPI/DATA0  */
#define   PPS_RPE1G2R_RPE1G2R_QD3_Val         _UINT32_(0x24)                                       /* (PPS_RPE1G2R) QSPI/DATA3  */
#define   PPS_RPE1G2R_RPE1G2R_QD2_Val         _UINT32_(0x25)                                       /* (PPS_RPE1G2R) QSPI/DATA2  */
#define   PPS_RPE1G2R_RPE1G2R_TSTBUS5_Val     _UINT32_(0x26)                                       /* (PPS_RPE1G2R) TSTBUS5  */
#define   PPS_RPE1G2R_RPE1G2R_TSTBUS9_Val     _UINT32_(0x27)                                       /* (PPS_RPE1G2R) TSTBUS9  */
#define   PPS_RPE1G2R_RPE1G2R_FECTRL0_Val     _UINT32_(0x28)                                       /* (PPS_RPE1G2R) FECTRL0  */
#define   PPS_RPE1G2R_RPE1G2R_COEX_RF_ACT_Val _UINT32_(0x29)                                       /* (PPS_RPE1G2R) COEX/RF/ACT  */
#define PPS_RPE1G2R_RPE1G2R_OFF               (PPS_RPE1G2R_RPE1G2R_OFF_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) OFF Position  */
#define PPS_RPE1G2R_RPE1G2R_CCLO1             (PPS_RPE1G2R_RPE1G2R_CCLO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) CCL/OUT1 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM0P0           (PPS_RPE1G2R_RPE1G2R_SCOM0P0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM0/PAD0 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM0P3           (PPS_RPE1G2R_RPE1G2R_SCOM0P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM0/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM0P2           (PPS_RPE1G2R_RPE1G2R_SCOM0P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM0/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM1P3           (PPS_RPE1G2R_RPE1G2R_SCOM1P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM1/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM1P2           (PPS_RPE1G2R_RPE1G2R_SCOM1P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM1/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM2P0           (PPS_RPE1G2R_RPE1G2R_SCOM2P0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM2/PAD0 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM2P3           (PPS_RPE1G2R_RPE1G2R_SCOM2P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM2/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM2P2           (PPS_RPE1G2R_RPE1G2R_SCOM2P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM2/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM3P3           (PPS_RPE1G2R_RPE1G2R_SCOM3P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM3/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM3P2           (PPS_RPE1G2R_RPE1G2R_SCOM3P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM3/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM4P0           (PPS_RPE1G2R_RPE1G2R_SCOM4P0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM4/PAD0 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM4P3           (PPS_RPE1G2R_RPE1G2R_SCOM4P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM4/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM4P2           (PPS_RPE1G2R_RPE1G2R_SCOM4P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM4/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM5P3           (PPS_RPE1G2R_RPE1G2R_SCOM5P3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM5/PAD3 Position  */
#define PPS_RPE1G2R_RPE1G2R_SCOM5P2           (PPS_RPE1G2R_RPE1G2R_SCOM5P2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) SERCOM5/PAD2 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC0WO1           (PPS_RPE1G2R_RPE1G2R_TCC0WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC0/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC0WO5           (PPS_RPE1G2R_RPE1G2R_TCC0WO5_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC0/WO5 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC0WO3           (PPS_RPE1G2R_RPE1G2R_TCC0WO3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC0/WO3 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC1WO1           (PPS_RPE1G2R_RPE1G2R_TCC1WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC1/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC1WO5           (PPS_RPE1G2R_RPE1G2R_TCC1WO5_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC1/WO5 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC1WO3           (PPS_RPE1G2R_RPE1G2R_TCC1WO3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC1/WO3 Position  */
#define PPS_RPE1G2R_RPE1G2R_TCC2WO1           (PPS_RPE1G2R_RPE1G2R_TCC2WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TCC2/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC0WO1            (PPS_RPE1G2R_RPE1G2R_TC0WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC0/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC1WO1            (PPS_RPE1G2R_RPE1G2R_TC1WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC1/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC2WO1            (PPS_RPE1G2R_RPE1G2R_TC2WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC2/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC3WO1            (PPS_RPE1G2R_RPE1G2R_TC3WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC3/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC4WO1            (PPS_RPE1G2R_RPE1G2R_TC4WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC4/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC5WO1            (PPS_RPE1G2R_RPE1G2R_TC5WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC5/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC6WO1            (PPS_RPE1G2R_RPE1G2R_TC6WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC6/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC7WO1            (PPS_RPE1G2R_RPE1G2R_TC7WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC7/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC8WO1            (PPS_RPE1G2R_RPE1G2R_TC8WO1_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC8/WO1 Position  */
#define PPS_RPE1G2R_RPE1G2R_TC9WO0            (PPS_RPE1G2R_RPE1G2R_TC9WO0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TC9/WO0 Position  */
#define PPS_RPE1G2R_RPE1G2R_QSPICS            (PPS_RPE1G2R_RPE1G2R_QSPICS_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) QSPI/CS Position  */
#define PPS_RPE1G2R_RPE1G2R_QD0               (PPS_RPE1G2R_RPE1G2R_QD0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) QSPI/DATA0 Position  */
#define PPS_RPE1G2R_RPE1G2R_QD3               (PPS_RPE1G2R_RPE1G2R_QD3_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) QSPI/DATA3 Position  */
#define PPS_RPE1G2R_RPE1G2R_QD2               (PPS_RPE1G2R_RPE1G2R_QD2_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) QSPI/DATA2 Position  */
#define PPS_RPE1G2R_RPE1G2R_TSTBUS5           (PPS_RPE1G2R_RPE1G2R_TSTBUS5_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TSTBUS5 Position  */
#define PPS_RPE1G2R_RPE1G2R_TSTBUS9           (PPS_RPE1G2R_RPE1G2R_TSTBUS9_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) TSTBUS9 Position  */
#define PPS_RPE1G2R_RPE1G2R_FECTRL0           (PPS_RPE1G2R_RPE1G2R_FECTRL0_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) FECTRL0 Position  */
#define PPS_RPE1G2R_RPE1G2R_COEX_RF_ACT       (PPS_RPE1G2R_RPE1G2R_COEX_RF_ACT_Val << PPS_RPE1G2R_RPE1G2R_Pos) /* (PPS_RPE1G2R) COEX/RF/ACT Position  */
#define PPS_RPE1G2R_Msk                       _UINT32_(0x0000003F)                                 /* (PPS_RPE1G2R) Register Mask  */


