Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/pps.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PPS register API structure */
typedef struct
{  /* PPS */
  __IO  uint32_t                       PPS_EXTINT0R;       /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT1R;       /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT2R;       /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT3R;       /**< Offset: 0x0C (R/W  32)  */
  __I   uint8_t                        Reserved1[0x2C];
  __IO  uint32_t                       PPS_NMIR;           /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P0R;       /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P1R;       /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P2R;       /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P3R;       /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P0R;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P1R;       /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P2R;       /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P3R;       /**< Offset: 0x5C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM2P0R;       /**< Offset: 0x60 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM2P1R;       /**< Offset: 0x64 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM2P2R;       /**< Offset: 0x68 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM2P3R;       /**< Offset: 0x6C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM3P0R;       /**< Offset: 0x70 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM3P1R;       /**< Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM3P2R;       /**< Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM3P3R;       /**< Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM4P0R;       /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM4P1R;       /**< Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM4P2R;       /**< Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM4P3R;       /**< Offset: 0x8C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM5P0R;       /**< Offset: 0x90 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM5P1R;       /**< Offset: 0x94 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM5P2R;       /**< Offset: 0x98 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM5P3R;       /**< Offset: 0x9C (R/W  32)  */
  __IO  uint32_t                       PPS_QD0R;           /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       PPS_QD1R;           /**< Offset: 0xA4 (R/W  32)  */
  __IO  uint32_t                       PPS_QD2R;           /**< Offset: 0xA8 (R/W  32)  */
  __IO  uint32_t                       PPS_QD3R;           /**< Offset: 0xAC (R/W  32)  */
  __IO  uint32_t                       PPS_REFIR;          /**< Offset: 0xB0 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN0R;        /**< Offset: 0xB4 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN1R;        /**< Offset: 0xB8 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN2R;        /**< Offset: 0xBC (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN3R;        /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN4R;        /**< Offset: 0xC4 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN5R;        /**< Offset: 0xC8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO0G1R;      /**< Offset: 0xCC (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO0G2R;      /**< Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO1G3R;      /**< Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO1G4R;      /**< Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC1WO0G1R;      /**< Offset: 0xDC (R/W  32)  */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       PPS_TC1WO1G2R;      /**< Offset: 0xE4 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       PPS_TC2WO0G1R;      /**< Offset: 0xEC (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO0G3R;      /**< Offset: 0xF0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO1G2R;      /**< Offset: 0xF4 (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO1G4R;      /**< Offset: 0xF8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO0G1R;      /**< Offset: 0xFC (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO0G3R;      /**< Offset: 0x100 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO1G2R;      /**< Offset: 0x104 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO1G4R;      /**< Offset: 0x108 (R/W  32)  */
  __IO  uint32_t                       PPS_TC4WO0G1R;      /**< Offset: 0x10C (R/W  32)  */
  __IO  uint32_t                       PPS_TC4WO0G3R;      /**< Offset: 0x110 (R/W  32)  */
  __IO  uint32_t                       PPS_TC4WO1G2R;      /**< Offset: 0x114 (R/W  32)  */
  __IO  uint32_t                       PPS_TC4WO1G4R;      /**< Offset: 0x118 (R/W  32)  */
  __IO  uint32_t                       PPS_TC5WO0G1R;      /**< Offset: 0x11C (R/W  32)  */
  __IO  uint32_t                       PPS_TC5WO0G3R;      /**< Offset: 0x120 (R/W  32)  */
  __IO  uint32_t                       PPS_TC5WO1G2R;      /**< Offset: 0x124 (R/W  32)  */
  __IO  uint32_t                       PPS_TC5WO1G4R;      /**< Offset: 0x128 (R/W  32)  */
  __IO  uint32_t                       PPS_TC6WO0G1R;      /**< Offset: 0x12C (R/W  32)  */
  __IO  uint32_t                       PPS_TC6WO0G3R;      /**< Offset: 0x130 (R/W  32)  */
  __IO  uint32_t                       PPS_TC6WO1G2R;      /**< Offset: 0x134 (R/W  32)  */
  __IO  uint32_t                       PPS_TC6WO1G4R;      /**< Offset: 0x138 (R/W  32)  */
  __IO  uint32_t                       PPS_TC7WO0G1R;      /**< Offset: 0x13C (R/W  32)  */
  __IO  uint32_t                       PPS_TC7WO0G3R;      /**< Offset: 0x140 (R/W  32)  */
  __IO  uint32_t                       PPS_TC7WO1G2R;      /**< Offset: 0x144 (R/W  32)  */
  __IO  uint32_t                       PPS_TC7WO1G4R;      /**< Offset: 0x148 (R/W  32)  */
  __IO  uint32_t                       PPS_TC8WO0G1R;      /**< Offset: 0x14C (R/W  32)  */
  __IO  uint32_t                       PPS_TC8WO0G3R;      /**< Offset: 0x150 (R/W  32)  */
  __IO  uint32_t                       PPS_TC8WO1G2R;      /**< Offset: 0x154 (R/W  32)  */
  __IO  uint32_t                       PPS_TC8WO1G5R;      /**< Offset: 0x158 (R/W  32)  */
  __IO  uint32_t                       PPS_TC9WO0G2R;      /**< Offset: 0x15C (R/W  32)  */
  __IO  uint32_t                       PPS_TC9WO0G4R;      /**< Offset: 0x160 (R/W  32)  */
  __IO  uint32_t                       PPS_TC9WO1G3R;      /**< Offset: 0x164 (R/W  32)  */
  __IO  uint32_t                       PPS_TC9WO1G5R;      /**< Offset: 0x168 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIHOME0G1R;    /**< Offset: 0x16C (R/W  32)  */
  __IO  uint32_t                       PPS_QEIHOME0G2R;    /**< Offset: 0x170 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIINDX0G2R;    /**< Offset: 0x174 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIINDX0G3R;    /**< Offset: 0x178 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIQEA0G3R;     /**< Offset: 0x17C (R/W  32)  */
  __IO  uint32_t                       PPS_QEIQEA0G4R;     /**< Offset: 0x180 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIQEB0G4R;     /**< Offset: 0x184 (R/W  32)  */
  __IO  uint32_t                       PPS_QEIQEB0G5R;     /**< Offset: 0x188 (R/W  32)  */
  __IO  uint32_t                       PPS_ACCMPTENR;      /**< Offset: 0x18C (R/W  32)  */
  __IO  uint32_t                       PPS_CAN1RXR;        /**< Offset: 0x190 (R/W  32)  */
  __IO  uint32_t                       PPS_COEXWLANACTR;   /**< Offset: 0x194 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x68];
  __IO  uint32_t                       PPS_RPA0G1R;        /**< Offset: 0x200 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA0G2R;        /**< Offset: 0x204 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA0G3R;        /**< Offset: 0x208 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA0G4R;        /**< Offset: 0x20C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA1G2R;        /**< Offset: 0x210 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA1G3R;        /**< Offset: 0x214 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA1G4R;        /**< Offset: 0x218 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA1G5R;        /**< Offset: 0x21C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA2G1R;        /**< Offset: 0x220 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA2G3R;        /**< Offset: 0x224 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA2G4R;        /**< Offset: 0x228 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G1R;        /**< Offset: 0x22C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G2R;        /**< Offset: 0x230 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G4R;        /**< Offset: 0x234 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G6R;        /**< Offset: 0x238 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G2R;        /**< Offset: 0x23C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G3R;        /**< Offset: 0x240 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G5R;        /**< Offset: 0x244 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G3R;        /**< Offset: 0x248 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G4R;        /**< Offset: 0x24C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G6R;        /**< Offset: 0x250 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G1R;        /**< Offset: 0x254 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G4R;        /**< Offset: 0x258 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G6R;        /**< Offset: 0x25C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA7G1R;        /**< Offset: 0x260 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA7G2R;        /**< Offset: 0x264 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA7G6R;        /**< Offset: 0x268 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G2R;        /**< Offset: 0x26C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G3R;        /**< Offset: 0x270 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G4R;        /**< Offset: 0x274 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G1R;        /**< Offset: 0x278 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G3R;        /**< Offset: 0x27C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G4R;        /**< Offset: 0x280 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA10G1R;       /**< Offset: 0x284 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA10G4R;       /**< Offset: 0x288 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA10G5R;       /**< Offset: 0x28C (R/W  32)  */
  __I   uint8_t                        Reserved5[0x10];
  __IO  uint32_t                       PPS_RPA13G3R;       /**< Offset: 0x2A0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA13G4R;       /**< Offset: 0x2A4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA14G1R;       /**< Offset: 0x2A8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA14G4R;       /**< Offset: 0x2AC (R/W  32)  */
  __IO  uint32_t                       PPS_RPA15G5R;       /**< Offset: 0x2B0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB0G1R;        /**< Offset: 0x2B4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB0G2R;        /**< Offset: 0x2B8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB0G5R;        /**< Offset: 0x2BC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB1G1R;        /**< Offset: 0x2C0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB1G2R;        /**< Offset: 0x2C4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB1G3R;        /**< Offset: 0x2C8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB2G2R;        /**< Offset: 0x2CC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB2G3R;        /**< Offset: 0x2D0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB2G4R;        /**< Offset: 0x2D4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB3G1R;        /**< Offset: 0x2D8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB3G3R;        /**< Offset: 0x2DC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB3G4R;        /**< Offset: 0x2E0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB4G1R;        /**< Offset: 0x2E4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB4G2R;        /**< Offset: 0x2E8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB4G4R;        /**< Offset: 0x2EC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB4G5R;        /**< Offset: 0x2F0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB5G2R;        /**< Offset: 0x2F4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB5G3R;        /**< Offset: 0x2F8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB5G6R;        /**< Offset: 0x2FC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G1R;        /**< Offset: 0x300 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G3R;        /**< Offset: 0x304 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G4R;        /**< Offset: 0x308 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G6R;        /**< Offset: 0x30C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB7G1R;        /**< Offset: 0x310 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB7G2R;        /**< Offset: 0x314 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB7G4R;        /**< Offset: 0x318 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G1R;        /**< Offset: 0x31C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G2R;        /**< Offset: 0x320 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G3R;        /**< Offset: 0x324 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G6R;        /**< Offset: 0x328 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB9G2R;        /**< Offset: 0x32C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB9G3R;        /**< Offset: 0x330 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB9G6R;        /**< Offset: 0x334 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB10G3R;       /**< Offset: 0x338 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB10G4R;       /**< Offset: 0x33C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB10G5R;       /**< Offset: 0x340 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB11G1R;       /**< Offset: 0x344 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB11G4R;       /**< Offset: 0x348 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB12G1R;       /**< Offset: 0x34C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB12G2R;       /**< Offset: 0x350 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB13G2R;       /**< Offset: 0x354 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB13G3R;       /**< Offset: 0x358 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB14G5R;       /**< Offset: 0x35C (R/W  32)  */
  __IO  uint32_t                       PPS_RPB15G5R;       /**< Offset: 0x360 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC0G1R;        /**< Offset: 0x364 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC0G2R;        /**< Offset: 0x368 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC1G2R;        /**< Offset: 0x36C (R/W  32)  */
  __IO  uint32_t                       PPS_RPC1G3R;        /**< Offset: 0x370 (R/W  32)  */
  __I   uint8_t                        Reserved6[0x14];
  __IO  uint32_t                       PPS_RPC7G2R;        /**< Offset: 0x388 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC7G4R;        /**< Offset: 0x38C (R/W  32)  */
  __IO  uint32_t                       PPS_RPC8G3R;        /**< Offset: 0x390 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC8G5R;        /**< Offset: 0x394 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC9G1R;        /**< Offset: 0x398 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC9G4R;        /**< Offset: 0x39C (R/W  32)  */
  __IO  uint32_t                       PPS_RPC10G5R;       /**< Offset: 0x3A0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPC11G5R;       /**< Offset: 0x3A4 (R/W  32)  */
  __I   uint8_t                        Reserved7[0x10];
  __IO  uint32_t                       PPS_RPD0G5R;        /**< Offset: 0x3B8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD1G5R;        /**< Offset: 0x3BC (R/W  32)  */
  __IO  uint32_t                       PPS_RPD2G3R;        /**< Offset: 0x3C0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD2G5R;        /**< Offset: 0x3C4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD3G1R;        /**< Offset: 0x3C8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD3G4R;        /**< Offset: 0x3CC (R/W  32)  */
  __IO  uint32_t                       PPS_RPD4G2R;        /**< Offset: 0x3D0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD4G5R;        /**< Offset: 0x3D4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD5G6R;        /**< Offset: 0x3D8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD6G1R;        /**< Offset: 0x3DC (R/W  32)  */
  __IO  uint32_t                       PPS_RPD6G3R;        /**< Offset: 0x3E0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD7G2R;        /**< Offset: 0x3E4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPD7G4R;        /**< Offset: 0x3E8 (R/W  32)  */
  __I   uint8_t                        Reserved8[0x20];
  __IO  uint32_t                       PPS_RPE0G1R;        /**< Offset: 0x40C (R/W  32)  */
  __IO  uint32_t                       PPS_RPE0G3R;        /**< Offset: 0x410 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE1G2R;        /**< Offset: 0x414 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE1G4R;        /**< Offset: 0x418 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE2G3R;        /**< Offset: 0x41C (R/W  32)  */
  __IO  uint32_t                       PPS_RPE2G5R;        /**< Offset: 0x420 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE3G4R;        /**< Offset: 0x424 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE4G1R;        /**< Offset: 0x428 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE4G5R;        /**< Offset: 0x42C (R/W  32)  */
  __IO  uint32_t                       PPS_RPE5G6R;        /**< Offset: 0x430 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE6G1R;        /**< Offset: 0x434 (R/W  32)  */
  __IO  uint32_t                       PPS_RPE6G2R;        /**< Offset: 0x438 (R/W  32)  */
} pps_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_PPS_COMPONENT_H_ */
